[{"data":1,"prerenderedAt":273},["ShallowReactive",2],{"pageNav":3,"navItems":133,"page":138,"8wrayvk6F1":139},{"sys":4,"total":6,"skip":7,"limit":8,"items":9,"includes":131},{"type":5},"Array",4,0,100,[10,40,60,107],{"metadata":11,"sys":14,"fields":35},{"tags":12,"concepts":13},[],[],{"space":15,"id":20,"type":21,"createdAt":22,"updatedAt":23,"environment":24,"publishedVersion":28,"revision":29,"contentType":30,"locale":34},{"sys":16},{"type":17,"linkType":18,"id":19},"Link","Space","6ujs3kwlc75h","6BTZml8MTqQkpoPQbDOadi","Entry","2024-08-10T12:20:09.119Z","2025-01-22T02:50:35.328Z",{"sys":25},{"id":26,"type":17,"linkType":27},"master","Environment",298,12,{"sys":31},{"type":17,"linkType":32,"id":33},"ContentType","blogPost","en-US",{"title":36,"slug":37,"body":38,"publishDate":39},"Events","events","::div{class=\"content-index\"}\n\n## West Cumbria 31st Oct 2025\n\nThis is a private invite only event being held in West Cumbria. Entertainments kick off from Fri afternoon until end of Sunday. Accommodation is provided for Fri, Sat & Sun night with departure Mon morning. Breakfast is included Sat, Sun & Mon morning.\n\n### Cost\n\nAll prices are per person based on a 3-night stay.\nPrices are based on maximum occupancy of the room.\nPrices include event entry, bed, breakfast (Sat, Sun & Mon), lunch buffet (Sat & Sun) & dinner (Fri, Sat & Sun) buffet.\n\n* Single room: £330\n* Double / Twin room: £260\n* Triple room (1 double, 1 single): £240\n* Quad room (1 double, 2 singles): £220\n\n#### Additional nights\n\nNeed to arrive early or depart late? That can be arranged too. Please keep in mind that these nights are provided for convenience or to enable you to do some local sight seeing. All prices are based on maximum occupancy of rooms. The cost per person of rooms will increase if beds are unoccupied. Prices are for bed & breakfast only there will be convention events operating outside of the Friday - Sunday.\n\n* Single room: £78\n* Double / Twin room: £48\n* Triple room: £46\n* Quad room: £44\n\nPrices are subject to change prior to opening for registration.\n\n### Entertainments\n\nDuring the weekend there are plans afoot for the following:\n\n* Casino games (no money involved)\n* Pub Quiz\n* Pumpkin Carving Competition\n* Karaoke & Dance nights\n* Fursuit Games\n* Movie showing\n* Boardgame spaces\n* Photography Opportunities\n* Special interest panels\n\n#### Dealers Den\n\nWe will evaluate demand for this during registration. If one occurs it will be an opportunity for dealers to trade for a couple of hours during the daytime. Our members site will also contain a directory of dealers that are members of the club.\n\n#### Fursuit Lounge\n\nThe lounge area will be a simple side room from the primary event space providing fans, water & light snacks.\n\n#### Even more...\n\nMembers are invited to run their own panels or stage performances.","2024-08-10T00:00+01:00",{"metadata":41,"sys":44,"fields":56},{"tags":42,"concepts":43},[],[],{"space":45,"id":47,"type":21,"createdAt":48,"updatedAt":49,"environment":50,"publishedVersion":52,"revision":53,"contentType":54,"locale":34},{"sys":46},{"type":17,"linkType":18,"id":19},"2utBAXLZGRYfQERXhb0zWd","2025-01-22T02:27:37.666Z","2025-01-22T02:46:03.380Z",{"sys":51},{"id":26,"type":17,"linkType":27},104,3,{"sys":55},{"type":17,"linkType":32,"id":33},{"title":57,"slug":58,"body":59,"publishDate":39},"Terms and Conditions","terms-and-conditions","::div{class=\"content-index\"}\n\n## Terms and Conditions\n\n# Definitions\n\n\"You\", \"member\", \"your\", and \"yourself\" relate to the person agreeing to these terms and conditions. “We”, \"our\", “Furrific”, \"club\" and “event” relate to the Furrific members club which is brought to you by the registered company, Furrific UK Ltd, company number 15666730, with registered address of Unit A, 82 James Carter Road, Mildenhall, United Kingdom, IP28 7DE.\n\n# What is this Document?\n\nThis document sets out the terms of conditions for membership and attendance of Furrific events. By registering for the club and it's events you agree to be bound by all of the following terms and conditions.\n\nFailure to adhere to the points below may result in your club membership being withdrawn, your removal from events.\n\nWith this in mind, please ensure that you read the following terms and conditions carefully and completely before accepting them.\n\n# Requirement of Membership\n\n* In order to be a member of Furrific you must be 18 years of age or older.\n* You must read, accept, and abide by the club's Code of Conduct & Constitution. The Code contains both general principles and more specific standards of behaviour that are expected of our members. If you breach any part of the Code of Conduct, your membership (and hotel booking or event bookings, if any) may be cancelled. With this in mind, please ensure you read the Code carefully and completely.\n* To receive your membership badge, which provides access to the event and activities therein, you must provide valid and in-date ID during on site registration. The ID provided must be government issued or bear the PASS holographic logo, it must also contain your photograph, your legal name, and your date of birth. These must all match the details provided to us during the online registration process. Please note that the ID should be in your legal name. If you are in the process of changing name you will need to provide government issued documentation to support this (e.g. Gender recognition certificate).\n* Failure to provide valid, in-date ID that meets the above criteria will render you unable to register for and participate in the club and its events and you may be asked to leave the venue.\n* You must make Furrific Ltd and it's first-aid team aware of any medical conditions that may require special care. Any such information provided will only be used by the first-aid team on duty to ensure that any emergency relating to your medical condition is handled appropriately.\n* Some events or activities may have additional Terms and Conditions, you must abide by these if participating in such events or activities.\n* All final decisions with regard to club policies, procedures, and their implementation lie with the Furrific committee.\n\n# Your Registration\n\n* All events and registration options are subject to availability.\n* If you are opting for a residential option at an event, it is your responsibility to arrange another attendee to share the room with where applicable.\n* Once we have reviewed your registration and sent a confirmation to you via your chosen email address, you will be requested to pay the full amount of the registration fee. Should you fail to pay when requested, your registration may be cancelled and any place at the event lost. If you are struggling to pay your registration on time, please contact our team at registration@furrific.uk to review your options.\n* Equally, if your room share partner does not pay their registration fee on time, your room booking may be at risk. Please contact our registration team at registration@furrific.uk immediately if this is the case.\n* If you are a participant in a room share for which the other person is the leader, their room choice will override any that you have made and neither Furrific Ltd, the event venues, or any other entity will be responsible if this does not meet with your expectations or requirements. Please communicate clearly with your chosen room partner and agree on your requirements in advance.\n* You agree to the terms and conditions of whichever payment provider you use in order to complete payment of the registration fee.\n* Once your registration for the event is confirmed and paid we may be unable to refund this if you subsequently wish to cancel your attendance.\n* You may be given the opportunity to upload an image to represent yourself on your membership badge. By using this functionality you bestow upon us the right to reproduce the image for the sole purpose of adding it to your membership badge and that you have the right to do so. The club may, at its discretion, decline an image should it be considered offensive or could bring the club into disrepute.\n* Any items given to Sponsor level attendees or those opting to purchase a t-shirt individually with a standard registration are given as recognition for the attendees support of the event and have no monetary value in the event that they should be refused or returned. Should these be delivered to the attendee in faulty condition a replacement will only be available while stocks remain. Replacements will not be available for items sustaining wear and tear damage or damage due to negligence outside that of the event.\n",{"metadata":61,"sys":64,"fields":76},{"tags":62,"concepts":63},[],[],{"space":65,"id":67,"type":21,"createdAt":68,"updatedAt":69,"environment":70,"publishedVersion":72,"revision":73,"contentType":74,"locale":34},{"sys":66},{"type":17,"linkType":18,"id":19},"3K9b0esdy0q0yGqgW2g6Ke","2024-06-04T23:50:40.065Z","2024-11-04T23:39:30.177Z",{"sys":71},{"id":26,"type":17,"linkType":27},79,7,{"sys":75},{"type":17,"linkType":32,"id":33},{"title":77,"slug":78,"description":79,"body":80,"author":81,"publishDate":104,"tags":105},"Membership","membership","Membership Details","::div{class=\"content-index\"}\n\n# Membership\n\nFurrific is a members only organisation operated by and for it's members. It is operated primarily by an elected voluntary committee of members.\n\n## How do I join?\n\nTo become a member you must be introduced by two existing members (a nominee & seconder). Membership spaces are limited so you may be entered onto a waiting list. Your application will then be reviewed by existing members giving them opportunity to either approve or reject. If you pass the review process you will be formally invited to join the club.\n\nIf you don't know any existing members you may still apply and existing members may choose to back your application.\n\n## What Next?\n\nExisting members are informed of your application to join the club, and you\nwill need to agree to basic personal details being shared with them for this to\nhappen. Typically, this will be just your Furry name and links to any social\nmedia presence.\n\nMembership applications are discussed and voted on, if approved you will be admitted into the club.\n\n## Membership Fees\n\nIf you attend any event during the year, the event fee covers your membership. If\nyou wish to retain membership without attending an event there is a £5 charge.\n\n## Who's in charge?\n\nEveryone! The club is fundamentally operated by it's members. We hold an AGM where members elect the operating committee for the coming year. At the AGM anyone currently holding a committee position or committee assigned role stands-down and must be re-elected if they wish to continue in that role.\n\nAll members are encouraged to get involved and lend a hand however they wish to even if they're not interested in being on the committee. Members lending a hand are referred to as Furrific Fellows.\n\n## What about the Directors?\n\nThe directors are required in order for the club to exist as a limited by guarantee company. Their main interest is ensuring legal compliance with the UK government and overseeing core administrative and financial tasks. Their powers are mostly delegated to the committee which they also hold a position on, they only veto decisions in matters where there would be a conflict of interest or a breach in legislation.\n\n::\n",{"metadata":82,"sys":85,"fields":98},{"tags":83,"concepts":84},[],[],{"space":86,"id":88,"type":21,"createdAt":89,"updatedAt":90,"environment":91,"publishedVersion":93,"revision":94,"contentType":95,"locale":34},{"sys":87},{"type":17,"linkType":18,"id":19},"15jwOBqpxqSAOy2eOO4S0m","2024-06-04T23:50:39.089Z","2024-06-05T13:58:04.865Z",{"sys":92},{"id":26,"type":17,"linkType":27},6,2,{"sys":96},{"type":17,"linkType":32,"id":97},"person",{"name":99,"title":100,"company":101,"shortBio":102,"email":103},"Frío","Director","Furrific Ltd","Research and recommendations for modern stack websites.","aaron.p@furrific.uk","2017-05-15T00:00+02:00",[106],"general",{"metadata":108,"sys":111,"fields":123},{"tags":109,"concepts":110},[],[],{"space":112,"id":114,"type":21,"createdAt":115,"updatedAt":116,"environment":117,"publishedVersion":119,"revision":120,"contentType":121,"locale":34},{"sys":113},{"type":17,"linkType":18,"id":19},"2PtC9h1YqIA6kaUaIsWEQ0","2024-06-04T23:50:40.511Z","2024-08-10T12:07:52.297Z",{"sys":118},{"id":26,"type":17,"linkType":27},58,5,{"sys":122},{"type":17,"linkType":32,"id":33},{"title":124,"slug":125,"description":124,"body":126,"author":81,"publishDate":127,"tags":128},"About Furrific","about","::div{class=\"content-index\"}\n\n# What is Furrific\n\nFurrific is a UK based members only club operated for and by its membership. It provides opportunities for it's members to meet, form new friendships and to enjoy events.\n\n# What we do\n\nWe arrange social events for our members, bringing together furries from different sub-communities.\nWe also help promote members business interests. The events we hold contain typical elements found at Furry conventions and smaller meets.\n\n# Members only\n\nFurrific is operated by it's members for the benefit of it's members. Membership can be obtained by invite from existing members or application.\n\n# Who we are\n\nFurrific was formed by a group of Furries looking to recognise others long-standing contributions to the furry fandom either by staffing conventions, fur-meets, running events, producing art, stories or anything else that has benefited the fandom and their allies.\n\n::\n\n::dl{class=\"md:grid md:grid-cols-[10rem_1fr]\"}\n\n::dt\nCompany Name\n::\n::dd\nFurrific Ltd\n::\n::dt\nRegistered Office\n::\n::dd\nUnit A 82 James Carter Road, Mildenhall, IP28 7DE.\n::\n::dt\nCompany Number\n::\n::dd\n15666730\n::\n::dt\nPlace of Registration\n::\n::dd\nEngland / Wales\n::\n::\n","2017-05-16T00:00+02:00",[129,130],"javascript","static-sites",{"Entry":132},[81],[134,135,136,137],{"title":36,"slug":37},{"title":57,"slug":58},{"title":77,"slug":78},{"title":124,"slug":125},{"title":124,"body":126,"heroImage":-1},{"data":140,"body":142,"excerpt":-1,"toc":271},{"title":141,"description":141},"",{"type":143,"children":144},"root",[145,199],{"type":146,"tag":147,"props":148,"children":151},"element","div",{"className":149},[150],"content-index",[152,160,166,172,177,183,188,194],{"type":146,"tag":153,"props":154,"children":156},"h1",{"id":155},"what-is-furrific",[157],{"type":158,"value":159},"text","What is Furrific",{"type":146,"tag":161,"props":162,"children":163},"p",{},[164],{"type":158,"value":165},"Furrific is a UK based members only club operated for and by its membership. It provides opportunities for it's members to meet, form new friendships and to enjoy events.",{"type":146,"tag":153,"props":167,"children":169},{"id":168},"what-we-do",[170],{"type":158,"value":171},"What we do",{"type":146,"tag":161,"props":173,"children":174},{},[175],{"type":158,"value":176},"We arrange social events for our members, bringing together furries from different sub-communities.\nWe also help promote members business interests. The events we hold contain typical elements found at Furry conventions and smaller meets.",{"type":146,"tag":153,"props":178,"children":180},{"id":179},"members-only",[181],{"type":158,"value":182},"Members only",{"type":146,"tag":161,"props":184,"children":185},{},[186],{"type":158,"value":187},"Furrific is operated by it's members for the benefit of it's members. Membership can be obtained by invite from existing members or application.",{"type":146,"tag":153,"props":189,"children":191},{"id":190},"who-we-are",[192],{"type":158,"value":193},"Who we are",{"type":146,"tag":161,"props":195,"children":196},{},[197],{"type":158,"value":198},"Furrific was formed by a group of Furries looking to recognise others long-standing contributions to the furry fandom either by staffing conventions, fur-meets, running events, producing art, stories or anything else that has benefited the fandom and their allies.",{"type":146,"tag":200,"props":201,"children":205},"dl",{"className":202},[203,204],"md:grid","md:grid-cols-[10rem_1fr]",[206,215,223,231,239,247,255,263],{"type":146,"tag":207,"props":208,"children":209},"dt",{},[210],{"type":146,"tag":161,"props":211,"children":212},{},[213],{"type":158,"value":214},"Company Name",{"type":146,"tag":216,"props":217,"children":218},"dd",{},[219],{"type":146,"tag":161,"props":220,"children":221},{},[222],{"type":158,"value":101},{"type":146,"tag":207,"props":224,"children":225},{},[226],{"type":146,"tag":161,"props":227,"children":228},{},[229],{"type":158,"value":230},"Registered Office",{"type":146,"tag":216,"props":232,"children":233},{},[234],{"type":146,"tag":161,"props":235,"children":236},{},[237],{"type":158,"value":238},"Unit A 82 James Carter Road, Mildenhall, IP28 7DE.",{"type":146,"tag":207,"props":240,"children":241},{},[242],{"type":146,"tag":161,"props":243,"children":244},{},[245],{"type":158,"value":246},"Company Number",{"type":146,"tag":216,"props":248,"children":249},{},[250],{"type":146,"tag":161,"props":251,"children":252},{},[253],{"type":158,"value":254},"15666730",{"type":146,"tag":207,"props":256,"children":257},{},[258],{"type":146,"tag":161,"props":259,"children":260},{},[261],{"type":158,"value":262},"Place of Registration",{"type":146,"tag":216,"props":264,"children":265},{},[266],{"type":146,"tag":161,"props":267,"children":268},{},[269],{"type":158,"value":270},"England / Wales",{"title":141,"searchDepth":94,"depth":94,"links":272},[],1737514263891]