[{"data":1,"prerenderedAt":241},["ShallowReactive",2],{"pageNav":3,"navItems":132,"page":137,"QJZnTkwd1g":138},{"sys":4,"total":6,"skip":7,"limit":8,"items":9,"includes":130},{"type":5},"Array",4,0,100,[10,39,59,106],{"metadata":11,"sys":14,"fields":34},{"tags":12,"concepts":13},[],[],{"space":15,"id":20,"type":21,"createdAt":22,"updatedAt":23,"environment":24,"publishedVersion":28,"revision":6,"contentType":29,"locale":33},{"sys":16},{"type":17,"linkType":18,"id":19},"Link","Space","6ujs3kwlc75h","2utBAXLZGRYfQERXhb0zWd","Entry","2025-01-22T02:27:37.666Z","2025-01-22T17:22:31.261Z",{"sys":25},{"id":26,"type":17,"linkType":27},"master","Environment",248,{"sys":30},{"type":17,"linkType":31,"id":32},"ContentType","blogPost","en-US",{"title":35,"slug":36,"body":37,"publishDate":38},"Terms and Conditions","terms-and-conditions","::div{class=\"content-index\"}\n\n# Terms and Conditions\n\n## Definitions\n\n\"You\", \"member\", \"your\", and \"yourself\" relate to the person agreeing to these terms and conditions. “We”, \"our\", “Furrific”, \"club\" and “event” relate to the Furrific members club which is brought to you by the registered company, Furrific UK Ltd, company number 15666730, with registered address of Unit A, 82 James Carter Road, Mildenhall, United Kingdom, IP28 7DE.\n\n## What is this Document?\n\nThis document sets out the terms of conditions for membership and attendance of Furrific events. By registering for the club and it's events you agree to be bound by all of the following terms and conditions.\n\nFailure to adhere to the points below may result in your club membership being withdrawn, your removal from events.\n\nWith this in mind, please ensure that you read the following terms and conditions carefully and completely before accepting them.\n\n## Requirement of Membership\n\n* In order to be a member of Furrific you must be 18 years of age or older.\n* You must read, accept, and abide by the club's Code of Conduct & Constitution. The Code contains both general principles and more specific standards of behaviour that are expected of our members. If you breach any part of the Code of Conduct, your membership (and hotel booking or event bookings, if any) may be cancelled. With this in mind, please ensure you read the Code carefully and completely.\n* To receive your membership badge, which provides access to the event and activities therein, you must provide valid and in-date ID during on site registration. The ID provided must be government issued or bear the PASS holographic logo, it must also contain your photograph, your legal name, and your date of birth. These must all match the details provided to us during the online registration process. Please note that the ID should be in your legal name. If you are in the process of changing name you will need to provide government issued documentation to support this (e.g. Gender recognition certificate).\n* Failure to provide valid, in-date ID that meets the above criteria will render you unable to register for and participate in the club and its events and you may be asked to leave the venue.\n* You must make Furrific Ltd and it's first-aid team aware of any medical conditions that may require special care. Any such information provided will only be used by the first-aid team on duty to ensure that any emergency relating to your medical condition is handled appropriately.\n* Some events or activities may have additional Terms and Conditions, you must abide by these if participating in such events or activities.\n* All final decisions with regard to club policies, procedures, and their implementation lie with the Furrific committee.\n\n## Your Membership\n\n* All events and membership options are subject to availability.\n* If you are opting for a residential option at an event, it is your responsibility to arrange another member to share the room with where applicable.\n* Once we have reviewed your registration and sent a confirmation to you via your chosen email address, you will be requested to pay the full amount of the registration fee. Should you fail to pay when requested, your registration may be cancelled and any place at the event lost. If you are struggling to pay your registration on time, please contact our team at registration@furrific.uk to review your options.\n* Equally, if your room share partner does not pay their registration fee on time, your room booking may be at risk. Please contact our registration team at registration@furrific.uk immediately if this is the case.\n* If you are a participant in a room share for which the other person is the leader, their room choice will override any that you have made and neither Furrific Ltd, the event venues, or any other entity will be responsible if this does not meet with your expectations or requirements. Please communicate clearly with your chosen room partner and agree on your requirements in advance.\n* You agree to the terms and conditions of whichever payment provider you use in order to complete payment of the registration fee.\n* Once your registration for the event is confirmed and paid we may be unable to refund this if you subsequently wish to cancel your attendance.\n* You may be given the opportunity to upload an image to represent yourself on your membership badge. By using this functionality you bestow upon us the right to reproduce the image for the sole purpose of adding it to your membership badge and that you have the right to do so. The club may, at its discretion, decline an image should it be considered offensive or could bring the club into disrepute.\n* Any items given to Sponsor level attendees or those opting to purchase a t-shirt individually with a standard registration are given as recognition for the attendees support of the event and have no monetary value in the event that they should be refused or returned. Should these be delivered to the member in faulty condition a replacement will only be available while stocks remain. Replacements will not be available for items sustaining wear and tear damage or damage due to negligence outside that of the event.\n\n## Cancellations\n\n* Furrific Ltd is not responsible for circumstances beyond reasonable control, including but not limited to acts of God, war, or terrorism, extreme weather conditions, pandemic, or government action. Furrific Ltd reserves the right to cancel events with no warning in these circumstances.\n* In the event that an event is cancelled, Furrific Ltd will offer members refunds to the amount possible given expenses already incurred directly and with respect to commitments. By registering you accept both this and the possibility that, should the cancellation occur at a late enough point, such refunds may not be 100% and could in fact be zero.\n\n## Events\n\n* Event venues are private property and they have the right to refuse entry for any reason.\n* Service animals are permitted, for pets permission must be sought from the club committee and are only permitted where venues allow.\n* You must respect the wishes and follow any reasonable instructions of both venue staff, the club's event team, and any security personnel.\n* You agree to read the safety plans provided by venues in case of fire or other emergencies and to follow the rules implemented by the venue for these scenarios if they occur.\n* If you are not the holder of a residential booking including accommodation at the event venue, you are not permitted to remain in the event spaces, communal areas, or venue rooms overnight and must leave the venue each day as soon as the last event or dance concludes. Attempting to stay in the venue overnight in contravention of this rule is strictly forbidden. The venue may seek to recover costs in these cases and the club will not be liable for covering these costs.\n* If you are the holder of a residential booking including accommodation at the venue, you must not permit any non-residential member to stay in your hotel room overnight.\n* Any instance of the above that is discovered may lead to the removal of both the non-residential person from the event and any other members discovered to be facilitating this action. No refund will be given for ticket or accommodation in these cases, nor any other form of remuneration. At the discretion of committee, such instances may lead to a temporary or permanent ban from the club or future events.\n* If you participate in any club auctions and submit a bid for an item on sale, you are entering a contract of commitment to pay the bid amount on completion of the auction in the event that you are the winning bidder.\n* Any care delivered by our first-aid team is given on a “best efforts” basis. The club and its teams volunteers are not responsible for any damage to property sustained while such care is delivered.\n* While reasonable effort is taken to ensure to avoid such incidents, by attending the event you may be exposed to allergens of various forms. Furrific UK Ltd, it's event venues, nor any other associated entity are not responsible for any injury or damage resulting from such exposure.\n\n## Your Property\n\n* Furrific Ltd and it's event hosts are not responsible for any of your property that is lost, stolen or damaged; this remains your responsibility at all times and includes any vehicle left in the venue car park, which is parked at your own risk. Please take all reasonable precautions to secure your vehicle and property.\n* If you choose to use the fursuit facilities at events, neither Furrific Ltd, the event venue, or any other entity can be held responsible for any damage to or loss of property sustained.\n* If you choose to participate in any activity at the event while wearing a costume of any kind, Furrific and the venue, nor any other entity, can be held responsible for any damage that it sustains.\n\n## Website & Provided Information\n\n* Data that you enter into our membership / event registration system will be protected as described in our Privacy Policy and in accordance with the Data Protection Act. However, you are responsible for maintaining the security of your own account and should take all necessary steps to protect your account details and password. If you believe your account has been compromised in some manner you should contact us at members@furrific.uk immediately. For data protection inquiries please contact secretary@furrific.uk.\n* Should there be any technical failure within the membership system, Furrific Ltd will act within reasonable means to correct any issues with your data that occur as a result.\n* Pricing for membership & events are displayed on our website and in the membership / event registration system. We reserve the right to vary this pricing and update it on our website and systems accordingly.\n* Should there be any error in the pricing details given, Furrific Ltd is not obliged to honour such incorrect pricing and any impacted members will be contacted to advise of the correct pricing.\n* We aim to have our website remain accessible to all. However, this cannot be permanently guaranteed and access to our website is therefore permitted on a temporary, as-is, and as-available basis. Occasionally and without notice we may suspend or withdraw access to the website or any of its constituent parts for reasons including, but not limited to, maintenance or update of contents. Furrific Ltd is not responsible for any loss or inconvenience from the website or its information being unavailable.\n\n## Liability\n\n* You agree not to hold Furrific Limited or its team members liable for injury or loss/damage to person or property while arriving, attending, or departing events. The full liability waiver is listed below and acceptance of it, while voluntary, is a condition of sale.\n* You agree to take reasonable precautions to prevent injury to yourself and your property during an event. As a condition of attending an event, you hereby, for yourself, your heirs, executors, and administrators, voluntarily and freely agree to assume all responsibilities for any and all risks of damage or injury that may occur to you or your property resulting from or arising out of, or incident to, your attendance of the event.\n* You hereby voluntarily and freely release and discharge Furrific Ltd and all of its volunteers, employees, agents, successors, and assignees from any and all claims, damages, and rights of action that you, your heirs, executors, and administrators now have or may hereafter have for any injury to you, or your property resulting from or arising out of, or incident to, your attendance of club events, including, but not limited to, any claims of damages or injury that might result from the negligence, actions, or omissions of the organisers of the club events and/or employees of Furrific Limited.\n* If there are any changes to this agreement or the associate policies, we will update these on our website and notify affected members by email.","2024-08-10T00:00+01:00",{"metadata":40,"sys":43,"fields":55},{"tags":41,"concepts":42},[],[],{"space":44,"id":46,"type":21,"createdAt":47,"updatedAt":48,"environment":49,"publishedVersion":51,"revision":52,"contentType":53,"locale":33},{"sys":45},{"type":17,"linkType":18,"id":19},"6BTZml8MTqQkpoPQbDOadi","2024-08-10T12:20:09.119Z","2025-01-22T02:52:14.762Z",{"sys":50},{"id":26,"type":17,"linkType":27},300,13,{"sys":54},{"type":17,"linkType":31,"id":32},{"title":56,"slug":57,"body":58,"publishDate":38},"Events","events","::div{class=\"content-index\"}\n\n## West Cumbria 31st Oct 2025\n\nThis is a private invite only event being held in West Cumbria. Entertainments kick off from Fri afternoon until end of Sunday. Accommodation is provided for Fri, Sat & Sun night with departure Mon morning. Breakfast is included Sat, Sun & Mon morning.\n\n### Cost\n\nAll prices are per person based on a 3-night stay.\nPrices are based on maximum occupancy of the room.\nPrices include event entry, bed, breakfast (Sat, Sun & Mon), lunch buffet (Sat & Sun) & dinner (Fri, Sat & Sun) buffet.\n\n* Single room: £350\n* Double / Twin room: £260\n* Triple room (1 double, 1 single): £240\n* Quad room (1 double, 2 singles): £220\n\n#### Additional nights\n\nNeed to arrive early or depart late? That can be arranged too. Please keep in mind that these nights are provided for convenience or to enable you to do some local sight seeing. All prices are based on maximum occupancy of rooms. The cost per person of rooms will increase if beds are unoccupied. Prices are for bed & breakfast only there will be convention events operating outside of the Friday - Sunday.\n\n* Single room: £78\n* Double / Twin room: £48\n* Triple room: £46\n* Quad room: £44\n\nPrices are subject to change prior to opening for registration.\n\n### Entertainments\n\nDuring the weekend there are plans afoot for the following:\n\n* Casino games (no money involved)\n* Pub Quiz\n* Pumpkin Carving Competition\n* Karaoke & Dance nights\n* Fursuit Games\n* Movie showing\n* Boardgame spaces\n* Photography Opportunities\n* Special interest panels\n\n#### Dealers Den\n\nWe will evaluate demand for this during registration. If one occurs it will be an opportunity for dealers to trade for a couple of hours during the daytime. Our members site will also contain a directory of dealers that are members of the club.\n\n#### Fursuit Lounge\n\nThe lounge area will be a simple side room from the primary event space providing fans, water & light snacks.\n\n#### Even more...\n\nMembers are invited to run their own panels or stage performances.",{"metadata":60,"sys":63,"fields":75},{"tags":61,"concepts":62},[],[],{"space":64,"id":66,"type":21,"createdAt":67,"updatedAt":68,"environment":69,"publishedVersion":71,"revision":72,"contentType":73,"locale":33},{"sys":65},{"type":17,"linkType":18,"id":19},"3K9b0esdy0q0yGqgW2g6Ke","2024-06-04T23:50:40.065Z","2024-11-04T23:39:30.177Z",{"sys":70},{"id":26,"type":17,"linkType":27},79,7,{"sys":74},{"type":17,"linkType":31,"id":32},{"title":76,"slug":77,"description":78,"body":79,"author":80,"publishDate":103,"tags":104},"Membership","membership","Membership Details","::div{class=\"content-index\"}\n\n# Membership\n\nFurrific is a members only organisation operated by and for it's members. It is operated primarily by an elected voluntary committee of members.\n\n## How do I join?\n\nTo become a member you must be introduced by two existing members (a nominee & seconder). Membership spaces are limited so you may be entered onto a waiting list. Your application will then be reviewed by existing members giving them opportunity to either approve or reject. If you pass the review process you will be formally invited to join the club.\n\nIf you don't know any existing members you may still apply and existing members may choose to back your application.\n\n## What Next?\n\nExisting members are informed of your application to join the club, and you\nwill need to agree to basic personal details being shared with them for this to\nhappen. Typically, this will be just your Furry name and links to any social\nmedia presence.\n\nMembership applications are discussed and voted on, if approved you will be admitted into the club.\n\n## Membership Fees\n\nIf you attend any event during the year, the event fee covers your membership. If\nyou wish to retain membership without attending an event there is a £5 charge.\n\n## Who's in charge?\n\nEveryone! The club is fundamentally operated by it's members. We hold an AGM where members elect the operating committee for the coming year. At the AGM anyone currently holding a committee position or committee assigned role stands-down and must be re-elected if they wish to continue in that role.\n\nAll members are encouraged to get involved and lend a hand however they wish to even if they're not interested in being on the committee. Members lending a hand are referred to as Furrific Fellows.\n\n## What about the Directors?\n\nThe directors are required in order for the club to exist as a limited by guarantee company. Their main interest is ensuring legal compliance with the UK government and overseeing core administrative and financial tasks. Their powers are mostly delegated to the committee which they also hold a position on, they only veto decisions in matters where there would be a conflict of interest or a breach in legislation.\n\n::\n",{"metadata":81,"sys":84,"fields":97},{"tags":82,"concepts":83},[],[],{"space":85,"id":87,"type":21,"createdAt":88,"updatedAt":89,"environment":90,"publishedVersion":92,"revision":93,"contentType":94,"locale":33},{"sys":86},{"type":17,"linkType":18,"id":19},"15jwOBqpxqSAOy2eOO4S0m","2024-06-04T23:50:39.089Z","2024-06-05T13:58:04.865Z",{"sys":91},{"id":26,"type":17,"linkType":27},6,2,{"sys":95},{"type":17,"linkType":31,"id":96},"person",{"name":98,"title":99,"company":100,"shortBio":101,"email":102},"Frío","Director","Furrific Ltd","Research and recommendations for modern stack websites.","aaron.p@furrific.uk","2017-05-15T00:00+02:00",[105],"general",{"metadata":107,"sys":110,"fields":122},{"tags":108,"concepts":109},[],[],{"space":111,"id":113,"type":21,"createdAt":114,"updatedAt":115,"environment":116,"publishedVersion":118,"revision":119,"contentType":120,"locale":33},{"sys":112},{"type":17,"linkType":18,"id":19},"2PtC9h1YqIA6kaUaIsWEQ0","2024-06-04T23:50:40.511Z","2024-08-10T12:07:52.297Z",{"sys":117},{"id":26,"type":17,"linkType":27},58,5,{"sys":121},{"type":17,"linkType":31,"id":32},{"title":123,"slug":124,"description":123,"body":125,"author":80,"publishDate":126,"tags":127},"About Furrific","about","::div{class=\"content-index\"}\n\n# What is Furrific\n\nFurrific is a UK based members only club operated for and by its membership. It provides opportunities for it's members to meet, form new friendships and to enjoy events.\n\n# What we do\n\nWe arrange social events for our members, bringing together furries from different sub-communities.\nWe also help promote members business interests. The events we hold contain typical elements found at Furry conventions and smaller meets.\n\n# Members only\n\nFurrific is operated by it's members for the benefit of it's members. Membership can be obtained by invite from existing members or application.\n\n# Who we are\n\nFurrific was formed by a group of Furries looking to recognise others long-standing contributions to the furry fandom either by staffing conventions, fur-meets, running events, producing art, stories or anything else that has benefited the fandom and their allies.\n\n::\n\n::dl{class=\"md:grid md:grid-cols-[10rem_1fr]\"}\n\n::dt\nCompany Name\n::\n::dd\nFurrific Ltd\n::\n::dt\nRegistered Office\n::\n::dd\nUnit A 82 James Carter Road, Mildenhall, IP28 7DE.\n::\n::dt\nCompany Number\n::\n::dd\n15666730\n::\n::dt\nPlace of Registration\n::\n::dd\nEngland / Wales\n::\n::\n","2017-05-16T00:00+02:00",[128,129],"javascript","static-sites",{"Entry":131},[80],[133,134,135,136],{"title":35,"slug":36},{"title":56,"slug":57},{"title":76,"slug":77},{"title":123,"slug":124},{"title":76,"body":79,"heroImage":-1},{"data":139,"body":141,"excerpt":-1,"toc":234},{"title":140,"description":140},"",{"type":142,"children":143},"root",[144],{"type":145,"tag":146,"props":147,"children":150},"element","div",{"className":148},[149],"content-index",[151,157,163,170,175,180,186,191,196,202,207,213,218,223,229],{"type":145,"tag":152,"props":153,"children":154},"h1",{"id":77},[155],{"type":156,"value":76},"text",{"type":145,"tag":158,"props":159,"children":160},"p",{},[161],{"type":156,"value":162},"Furrific is a members only organisation operated by and for it's members. It is operated primarily by an elected voluntary committee of members.",{"type":145,"tag":164,"props":165,"children":167},"h2",{"id":166},"how-do-i-join",[168],{"type":156,"value":169},"How do I join?",{"type":145,"tag":158,"props":171,"children":172},{},[173],{"type":156,"value":174},"To become a member you must be introduced by two existing members (a nominee & seconder). Membership spaces are limited so you may be entered onto a waiting list. Your application will then be reviewed by existing members giving them opportunity to either approve or reject. If you pass the review process you will be formally invited to join the club.",{"type":145,"tag":158,"props":176,"children":177},{},[178],{"type":156,"value":179},"If you don't know any existing members you may still apply and existing members may choose to back your application.",{"type":145,"tag":164,"props":181,"children":183},{"id":182},"what-next",[184],{"type":156,"value":185},"What Next?",{"type":145,"tag":158,"props":187,"children":188},{},[189],{"type":156,"value":190},"Existing members are informed of your application to join the club, and you\nwill need to agree to basic personal details being shared with them for this to\nhappen. Typically, this will be just your Furry name and links to any social\nmedia presence.",{"type":145,"tag":158,"props":192,"children":193},{},[194],{"type":156,"value":195},"Membership applications are discussed and voted on, if approved you will be admitted into the club.",{"type":145,"tag":164,"props":197,"children":199},{"id":198},"membership-fees",[200],{"type":156,"value":201},"Membership Fees",{"type":145,"tag":158,"props":203,"children":204},{},[205],{"type":156,"value":206},"If you attend any event during the year, the event fee covers your membership. If\nyou wish to retain membership without attending an event there is a £5 charge.",{"type":145,"tag":164,"props":208,"children":210},{"id":209},"whos-in-charge",[211],{"type":156,"value":212},"Who's in charge?",{"type":145,"tag":158,"props":214,"children":215},{},[216],{"type":156,"value":217},"Everyone! The club is fundamentally operated by it's members. We hold an AGM where members elect the operating committee for the coming year. At the AGM anyone currently holding a committee position or committee assigned role stands-down and must be re-elected if they wish to continue in that role.",{"type":145,"tag":158,"props":219,"children":220},{},[221],{"type":156,"value":222},"All members are encouraged to get involved and lend a hand however they wish to even if they're not interested in being on the committee. Members lending a hand are referred to as Furrific Fellows.",{"type":145,"tag":164,"props":224,"children":226},{"id":225},"what-about-the-directors",[227],{"type":156,"value":228},"What about the Directors?",{"type":145,"tag":158,"props":230,"children":231},{},[232],{"type":156,"value":233},"The directors are required in order for the club to exist as a limited by guarantee company. Their main interest is ensuring legal compliance with the UK government and overseeing core administrative and financial tasks. Their powers are mostly delegated to the committee which they also hold a position on, they only veto decisions in matters where there would be a conflict of interest or a breach in legislation.",{"title":140,"searchDepth":93,"depth":93,"links":235},[236,237,238,239,240],{"id":166,"depth":93,"text":169},{"id":182,"depth":93,"text":185},{"id":198,"depth":93,"text":201},{"id":209,"depth":93,"text":212},{"id":225,"depth":93,"text":228},1737566656164]