[{"data":1,"prerenderedAt":1028},["ShallowReactive",2],{"page":3,"menuNav":6,"navItems":329,"nXrhLZeEzy":344},{"title":4,"body":5,"heroImage":-1,"styles":-1},"Constitution","::div{class=\"content-index\"}\n\n# Constitution of Furrific Ltd\n\nWe, the members of Furrific, establish this constitution to govern our operations and uphold our shared values within the furry community. This constitution embodies inclusivity, transparency, and collective governance, fostering a vibrant and welcoming furry community. This constitution is in addition to the articles of association using the devolved powers granted to it by the directors.\n\n## 1. Name\n1.1. The name of the company is “Furrific Ltd”, hereafter referred to as “the organisation.”\n\n## 2. Purpose\n2.1. The purpose of the organisation shall be to provide a platform for its members to engage in social, recreational, and educational activities pertaining to the furry fandom whilst fostering a sense of community and camaraderie among its members.\n\n## 3. Membership\n3.1. Membership in the organisation shall be open to individuals who meet the membership criteria as determined by the organisation’s governing body.  \n3.2. Annual membership fee, set by the committee.  \n3.3. Prospective members shall submit a membership application which will require nomination and seconding by existing members, in addition to any required dues or fees as determined by the organisation.  \n3.4. New members will be subject to vetting by the membership body.  \n3.5. The directors may revoke or suspend membership for violations of the organisation’s rules, conduct deemed detrimental to the organisation’s reputation or behaviour threatening to the welfare of other members.  \n3.6. Members must be over 18 years old.  \n3.7. Members should be considered to be of good moral standing.  \n3.8. The committee may limit the number of memberships as deemed necessary.  \n3.9. A new member will be required to wait for an opening if this limit is exceeded.\n\n## 4. Governance\n\n### 4.1. Board of Directors\n4.1.1. Responsible for legal matters and holds veto power over decisions with legal implications.  \n4.1.2. Directors must have a clean legal record and automatically hold a position on the committee.  \n4.1.3. A minimum of three directors are required to prevent stalemate, vacancies are filled promptly through AGM or EGM.  \n4.1.4. Complimentary membership renewals are granted after three years of service.  \n4.1.5. Are governed by the articles of association & legal obligations.  \n4.1.6. Hold de facto positions on committees.\n\n### 4.2. Committee\n4.2.1. Composed of directors board plus at least 2 additional members.  \n4.2.2. Responsible for overall management and operation of the organisation including setting policies, approving budgets and organising events.  \n4.2.3. Additional members elected at the AGM.  \n4.2.4. The size of the committee is decided by directors at the AGM.  \n4.2.5. Committee may vote to co-opt up to 3 additional members or up to 1% of membership whichever is greater.  \n4.2.6. Provides strategic guidance and ensures compliance with governing documents.  \n4.2.7. Committee members shall serve a term of 1 year from date of appointment, with an allowance up to a maximum of 2 years if circumstances require. Committee members may only serve additional years following re-election by members or co-opted by the current committee.  \n4.2.8. Committee members may be removed for misconduct or neglect of duties by a two-thirds majority vote of the membership.  \n4.2.9. Responsible for formation of officers and providing support to them.  \n4.2.10. Should document processes & contacts.  \n4.2.11. A quorum is achieved when more than half of committee members inc. directors are present.  \n4.2.12. Resolutions by committee are conducted by instant run-off (alternative vote) with at least two-thirds (66%) majority required to pass.  \n4.2.13. 3 members of the committee are required to act as chair, secretary & treasurer. These positions are collectively referred to as the committee coordinators.\n\n#### 4.2.14. Committee Chair\n4.2.14.1. A primary representative of the organisation, overseeing all its objectives.  \n4.2.14.2. Chairs all committee meetings ensuring they run smoothly and in an orderly manner.  \n4.2.14.3. Leads on key decision-making, ensuring all perspectives within the organisation are considered.  \n4.2.14.4. Acts as a mediator for disputes or conflicts, aiming to maintain a welcoming atmosphere for all members.  \n4.2.14.5. Develops and drives the long-term vision for the organisation, considering future events, collaborations and community involvement.  \n4.2.14.6. Ensures that the committee members fulfil their duties and supports them in their roles as needed.\n\n#### 4.2.15. Secretary\n4.2.15.1. Organises and documents meetings, including preparing agendas, sending invites, taking minutes and distributing them.  \n4.2.15.2. Overseas membership applications, renewals and maintains an accurate database of members, ensuring records are up to date.  \n4.2.15.3. Primary point of communication for members, handling inquiries and distributing announcements and updates.  \n4.2.15.4. Keeps accurate records of activities, decisions and communications, ensuring they are accessible to the committee.  \n4.2.15.5. Assists in the planning and organisation of events, helping coordinate logistics and promotions.\n\n#### 4.2.16. Treasurer\n4.2.16.1. Oversees the organisation's finances, including budgeting, monitoring expenses and ensuring financial stability.  \n4.2.16.2. Keep detailed financial records, including income from both member and non-member activities, manage receipts, invoices and payment records.  \n4.2.16.3. Prepare financial reports for the committee and members, including annual statements, forecasts and balance sheets.  \n4.2.16.4. Manage the collection of membership payments, ensuring payments are on time and follow up on any late payments.  \n4.2.16.5. Identifies opportunities for fundraising, sponsorships, and grants to support the organisation's objectives, and manages funds raised through events or other initiatives.  \n4.2.16.6. Ensures compliance with financial regulations, including proper handling of taxable and non-taxable income, in line with mutual trading rules.\n\n### 4.3. Team Leads\n4.3.1. Appointed by the committee from membership, capable non-committee members are preferred.  \n4.3.2. Perform tasks delegated by the committee.  \n4.3.3. Leads may recruit crew/volunteers from membership into their teams where applicable.  \n4.3.4. Leads serve for a term of 1 year, up to a maximum of 2 years if circumstances require. May be reappointed for additional terms by the committee.  \n4.3.5. Leads may be removed from positions for misconduct or neglect of duties by a two-thirds majority vote of the committee.\n\n### 4.4. Fellows\n4.4.1. Recruited by leads to assist in their tasks & projects.  \n4.4.2. Managed directly by leads and report back to them.\n\n## 5. Meetings\n5.1. The committee shall hold regular meetings at least 3 times per year.  \n5.2. Notice of the meetings shall be provided to all applicable members at least 14 days in advance.  \n5.3. All meetings shall be conducted according to procedures ensuring order is maintained and all members have an opportunity to participate.\n\n### 5.4. Voting\n5.4.1. Proxy voting is permitted before meetings, members are notified seven days in advance.  \n5.4.2. Candidate proposals are distributed no less than seven days before elections.  \n5.4.3. Any member with more than 1 year of membership is entitled to participate in organisation-wide votes.  \n5.4.4. Alternative vote a.k.a. Instant run-off to be used where there are greater than 2 options available. Rounds continue until a greater than 50% majority is achieved.\n\n### 5.5. AGM\n5.5.1. AGMs are held once per year, ideally within 14 months of the previous meeting where possible. But no more than 24 months.  \n5.5.2. Directors, chair, secretary & treasurer to submit reports, and additional reports provided by leads where applicable.  \n5.5.3. The existing committee is dissolved, leads & fellows are relieved of duties.  \n5.5.4. New committee members are elected by members as follows:  \n  5.5.4.1. Candidates read their proposals.  \n  5.5.4.2. Members vote for candidates through instant runoff a.k.a. Alternative vote.  \n5.5.5. Committee appoints leads at the first meeting proceeding the AGM.\n\n### 5.6. EGM\n5.6.1. Called by directors or committee secretary upon request.  \n5.6.2. May be called to resolve matters that can’t wait until the next AGM.  \n5.6.3. The committee is not dissolved, leads & fellows retain status unless resolved resolutions require.\n\n## 6. Events\n6.1. Organised by committee with support from leads & fellows.  \n6.2. The committee is responsible for appointing appropriate leads to ensure smooth running of the event.  \n6.3. To be for the benefit of the majority of members.  \n6.4. Should be self-funding.\n\n### 6.5. On-duty Officer Role\n\n#### 6.5.1. Definition and Appointment\n6.5.1.1. The On-Duty Officer is a temporary position assigned during the organisation's events to ensure smooth and consistent oversight of event operations.  \n6.5.1.2. The committee shall appoint an On-Duty Officer for each event or delegate the role in rotation among qualified individuals as designated by the committee.\n\n#### 6.5.2. Authority and Responsibilities\n6.5.2.1. The On-Duty Officer shall have the authority to make immediate operational decisions during the organisation’s events in response to urgent matters, safety issues, and general event flow to ensure a secure and enjoyable experience for all members.  \n6.5.2.2. This role includes overseeing activities, coordinating between the organisation’s event team and members, and addressing unforeseen issues or emergencies.\n\n#### 6.5.3. Limitations of Authority\n6.5.3.1. While empowered to make necessary decisions for event continuity, the On-Duty Officer must act in the best interest of the current event, the organisation, plus its members and in accordance with the organisation’s policies and guidelines.  \n6.5.3.2. Major decisions affecting the organisation’s policies, finances, or constitutional matters require consultation with the committee or the directors if practical within the time frame.\n\n#### 6.5.4. Accountability\n6.5.4.1. The On-Duty Officer must document all significant actions taken and decisions made in a report, to be presented to the committee and directors after the event for review.  \n6.5.4.2. Any actions that exceed the scope of their authority or contravene the organisation’s policies may be subject to committee review and potential corrective actions.\n\n## 7. Finances\n7.1. The organisation shall maintain accurate financial records and operate within a budget approved by the committee.  \n7.2. Dues and fees shall be determined by the committee.  \n7.3. The treasurer shall be responsible for collecting dues, paying expenses and providing financial reports to the membership.  \n7.4. Members may claim for expenses no later than 6 months after the date of receipt. Committee approval is otherwise required.  \n7.5. Treasurer to provide guidance on expenses which require additional approval.  \n7.6. All bank accounts should where possible require 2 or more signatories to approve any outgoing payment.  \n7.7. All directors have access to bank accounts in addition where possible to the treasurer & secretary.  \n7.8. Accounts should be maintained using a double or triple-entry system.  \n7.9. Treasurer may select the organisation used for managing the accounts providing it complies with the above.\n\n## 8. Amendments\n8.1. This constitution may be amended by a two-thirds (66%) majority vote by the membership at an AGM or EGM.  \n8.2. Proposed amendments must be submitted in writing to the secretary and distributed to all members at least 7 days in advance of the meeting.\n\n## 9. Dissolution\n9.1. In the event of the dissolution of the organisation, any remaining assets after liabilities shall be returned to the membership.\n\n## 10. Ratification\n10.1. This constitution shall take effect upon approval by a two-thirds majority vote of the membership.\n",{"sys":7,"total":9,"skip":10,"limit":11,"items":12,"includes":326},{"type":8},"Array",1,0,100,[13],{"metadata":14,"sys":17,"fields":38},{"tags":15,"concepts":16},[],[],{"space":18,"id":23,"type":24,"createdAt":25,"updatedAt":26,"environment":27,"publishedVersion":31,"revision":32,"contentType":33,"locale":37},{"sys":19},{"type":20,"linkType":21,"id":22},"Link","Space","6ujs3kwlc75h","43ksTBR04DKtr1V1GGAEHc","Entry","2025-02-13T17:26:08.273Z","2025-02-14T01:39:57.805Z",{"sys":28},{"id":29,"type":20,"linkType":30},"master","Environment",7,3,{"sys":34},{"type":20,"linkType":35,"id":36},"ContentType","menu","en-US",{"name":39,"entries":40},"Main Menu",[41,104,139],{"metadata":42,"sys":45,"fields":56},{"tags":43,"concepts":44},[],[],{"space":46,"id":48,"type":24,"createdAt":49,"updatedAt":49,"environment":50,"publishedVersion":52,"revision":9,"contentType":53,"locale":37},{"sys":47},{"type":20,"linkType":21,"id":22},"3c431RVsZX0vT3k3Qe0Lhn","2025-02-13T17:28:38.638Z",{"sys":51},{"id":29,"type":20,"linkType":30},8,{"sys":54},{"type":20,"linkType":35,"id":55},"menuItem",{"title":57,"link":58},"Home",{"metadata":59,"sys":62,"fields":74},{"tags":60,"concepts":61},[],[],{"space":63,"id":65,"type":24,"createdAt":66,"updatedAt":67,"environment":68,"publishedVersion":70,"revision":52,"contentType":71,"locale":37},{"sys":64},{"type":20,"linkType":21,"id":22},"u1Ghc7V6kyvZqYxacelAR","2024-08-08T22:20:18.949Z","2025-02-24T01:36:44.181Z",{"sys":69},{"id":29,"type":20,"linkType":30},101,{"sys":72},{"type":20,"linkType":35,"id":73},"blogPost",{"title":57,"slug":75,"heroImage":76,"description":101,"body":102,"publishDate":103},"/",{"metadata":77,"sys":80,"fields":89},{"tags":78,"concepts":79},[],[],{"space":81,"id":83,"type":84,"createdAt":85,"updatedAt":85,"environment":86,"publishedVersion":88,"revision":9,"locale":37},{"sys":82},{"type":20,"linkType":21,"id":22},"5Dq9eFU6EpZohsz8kcRyem","Asset","2024-08-08T22:19:15.080Z",{"sys":87},{"id":29,"type":20,"linkType":30},6,{"title":90,"description":91,"file":92},"Main Logo - Black","SVG Version of main logo",{"url":93,"details":94,"fileName":99,"contentType":100},"//images.ctfassets.net/6ujs3kwlc75h/5Dq9eFU6EpZohsz8kcRyem/5ab42a84ef528df9ba5f92c487c51642/logo.svg",{"size":95,"image":96},22647,{"width":97,"height":98},396,203,"logo.svg","image/svg+xml","Home page","::div{class=\"content-index\"}\n\n# ![Furrific](images/logo.svg){class=\"mx-auto block\" width=396 height=203}\n\n::div{class=\"font-medium text-center\"}\nA Club for the Furry Fandom\n::\n\n::div{class=\"text-center\"}\nFurrific is a UK based non-profit members only club operated for and by its membership.\n::\n\n## Furry fandom?\n\nThe furry fandom is a subculture with many members identifying as LGBTQ+ interested in anthropomorphic animal characters—animals with human traits, such as walking on two legs, wearing clothes, or speaking. This fandom is known for its diverse and vibrant community, creative expression, and various activities centered around these anthropomorphic characters.\n\n### Key aspects of the furry fandom\n\n#### Inclusivity\n\n* **Sexuality**: The furry fandom has always been a strong safe-space for gay, lesbian, bisexual, pansexual & asexual members. It is welcoming to everyone regardless of how you identify.\n* **Gender**: More members than ever now identify as trans or gender non-conforming. The furry fandom creates an environment is which its members feel safe to be the people they truly are.\n* **Neurodivergent**: Be it autism, ADHD, dyslexia, dyspraxia, or any of many other cognitive differences; the furry fandom knows how to embrace these traits in people and is stronger for it.\n\n#### Art and creativity\n\n* **Artwork**: One of the most prominent features of the furry fandom is the creation and sharing of artwork depicting anthropomorphic animals. This includes illustrations, digital art, comics, and animations.\n* **Literature and Music**: In addition to visual art, the fandom also includes writers and musicians who create works featuring anthropomorphic characters.\n* **Fursuits**: Some members create or commission elaborate costumes, called fursuits, that represent their anthropomorphic animal personas, or \"fursonas\".\n\n#### Fursonas\n\n* **Definition**: A fursona is a personalised anthropomorphic animal character created by a member of the furry fandom. It often reflects aspects of the person's personality, interests, or aspirations.\n* **Representation**: Fursonas can vary widely in species, appearance, and backstory, and they serve as avatars for interaction within the community.\n\n#### Conventions and gatherings:\n\n* **Conventions**: Large-scale events, such as Anthrocon, Midwest FurFest, and Eurofurence, provide a space for fans to meet, share their work, participate in panels, and attend dances and other social events.\n* **Meetups**: Smaller, local gatherings and meetups also take place, providing more intimate settings for fans to connect.\n\n#### Online communities:\n\n* **Forums and Social Media**: The furry fandom has a significant online presence through forums, social media platforms, and dedicated websites like FurAffinity and DeviantArt.\n* **Roleplaying and Gaming**: Many fans engage in online roleplaying games, creating stories and scenarios for their fursonas.\n\n#### Diverse interests:\n\n* **Broad Backgrounds**: Members of the fandom come from virtually every walk of life, meaning almost any interest or hobby will find a home within the fandom.\n* **Charity Work**: Many furry conventions and events incorporate charity fundraisers, supporting various causes.\n\nThe furry fandom is a vibrant and creative community that celebrates anthropomorphic animal characters. Through art, conventions, online interactions, and personal expression, members connect over their shared interests and contribute to a rich and multifaceted subculture.\n\n::","2024-08-08T00:00+01:00",{"metadata":105,"sys":108,"fields":117},{"tags":106,"concepts":107},[],[],{"space":109,"id":111,"type":24,"createdAt":112,"updatedAt":112,"environment":113,"publishedVersion":32,"revision":9,"contentType":115,"locale":37},{"sys":110},{"type":20,"linkType":21,"id":22},"3chVNlFEzUwRu6LLRE59s9","2025-02-13T17:29:16.774Z",{"sys":114},{"id":29,"type":20,"linkType":30},{"sys":116},{"type":20,"linkType":35,"id":55},{"title":118,"link":119},"Events",{"metadata":120,"sys":123,"fields":135},{"tags":121,"concepts":122},[],[],{"space":124,"id":126,"type":24,"createdAt":127,"updatedAt":128,"environment":129,"publishedVersion":131,"revision":132,"contentType":133,"locale":37},{"sys":125},{"type":20,"linkType":21,"id":22},"6BTZml8MTqQkpoPQbDOadi","2024-08-10T12:20:09.119Z","2025-02-24T00:26:09.341Z",{"sys":130},{"id":29,"type":20,"linkType":30},340,16,{"sys":134},{"type":20,"linkType":35,"id":73},{"title":118,"slug":136,"body":137,"publishDate":138},"/events","::div{class=\"content-index\"}\n\n## 31st October 2025: West Cumbria\n\nThis is a private, invite-only event being held in West Cumbria. Entertainments kick off from Friday afternoon until end of Sunday. Accommodation is provided for Friday, Saturday, and Sunday night with departure Monday morning.\n\n### Cost\n\nAll prices are per person based on a 3-night stay (Friday, Saturday, and Sunday night) and maximum occupancy of the room.\nPrices include event entry, bed, breakfast (Saturday, Sunday, and Monday), lunch buffet (Saturday and Sunday), and dinner buffet (Friday, Saturday, and Sunday).\n\n* Single room: £350\n* Double / Twin room: £260\n* Triple room (1 double, 1 single): £240\n* Quad room (1 double, 2 singles): £220\n\n### Additional nights\n\nNeed to arrive early or depart late? That can be arranged too. Please keep in mind that these nights are provided for convenience or to enable you to do some local sight seeing. All prices are based on maximum occupancy of rooms. The cost per person of rooms will increase if beds are unoccupied. Prices are for bed & breakfast only there will be no convention events operating outside of the Friday to Sunday period.\n\n* Single room: £78\n* Double / Twin room: £48\n* Triple room: £46\n* Quad room: £44\n\nPrices are subject to change prior to opening for registration.\n\n### Entertainments\n\nDuring the weekend there are plans afoot for the following:\n\n* Casino games (no money involved)\n* Pub quiz\n* Pumpkin carving competition\n* Karaoke & dance nights\n* Fursuit games\n* Movie showing\n* Boardgame spaces\n* Photography opportunities\n* Special interest panels\n\n### Dealers den\n\nWe will evaluate demand for this during registration. If one occurs it will be an opportunity for dealers to trade for a couple of hours during the daytime. Our members site will also contain a directory of dealers that are members of the club.\n\n### Fursuit lounge\n\nThe lounge area will be a simple side room from the primary event space providing fans, water & light snacks.\n\n### Even more...\n\nMembers will be invited to run their own panels or stage performances.","2024-08-10T00:00+01:00",{"metadata":140,"sys":143,"fields":155},{"tags":141,"concepts":142},[],[],{"space":144,"id":146,"type":24,"createdAt":147,"updatedAt":148,"environment":149,"publishedVersion":151,"revision":152,"contentType":153,"locale":37},{"sys":145},{"type":20,"linkType":21,"id":22},"5f2VvdIetNeO3Cd8VCeSap","2025-02-13T17:39:41.490Z","2025-02-23T23:44:56.759Z",{"sys":150},{"id":29,"type":20,"linkType":30},13,5,{"sys":154},{"type":20,"linkType":35,"id":55},{"title":156,"link":157,"children":202},"About Furrific",{"metadata":158,"sys":161,"fields":173},{"tags":159,"concepts":160},[],[],{"space":162,"id":164,"type":24,"createdAt":165,"updatedAt":166,"environment":167,"publishedVersion":169,"revision":170,"contentType":171,"locale":37},{"sys":163},{"type":20,"linkType":21,"id":22},"2PtC9h1YqIA6kaUaIsWEQ0","2024-06-04T23:50:40.511Z","2025-02-24T00:24:07.189Z",{"sys":168},{"id":29,"type":20,"linkType":30},87,12,{"sys":172},{"type":20,"linkType":35,"id":73},{"title":156,"slug":174,"description":156,"body":175,"author":176,"publishDate":198,"tags":199},"/about","::div{class=\"content-index\"}\n\n# What is Furrific\n\nFurrific is a UK based members-only club operated for and by its membership. It provides opportunities for its members to meet, form new friendships, and to enjoy events.\n\n# What we do\n\nWe arrange social events for our members, bringing together furries from different sub-communities. We also help promote members business interests. The events we hold contain typical elements found at furry conventions and smaller meets.\n\n# Members only\n\nFurrific is operated by its members for the benefit of its members. Membership can be obtained by invite from existing members or by application.\n\n# Who we are\n\nFurrific was formed by a group of furries looking to recognise others long-standing contributions to the furry fandom either by staffing conventions, fur meets, running events, producing art, stories, or anything else that has benefited the fandom and its allies.\n\n::\n\n::dl{class=\"md:grid md:grid-cols-[10rem_1fr]\"}\n\n::dt\nCompany Name\n::\n::dd\nFurrific Ltd\n::\n::dt\nRegistered Office\n::\n::dd\nUnit A 82 James Carter Road, Mildenhall, IP28 7DE\n::\n::dt\nCompany Number\n::\n::dd\n15666730\n::\n::dt\nPlace of Registration\n::\n::dd\nEngland / Wales\n::\n::\n",{"metadata":177,"sys":180,"fields":192},{"tags":178,"concepts":179},[],[],{"space":181,"id":183,"type":24,"createdAt":184,"updatedAt":185,"environment":186,"publishedVersion":88,"revision":188,"contentType":189,"locale":37},{"sys":182},{"type":20,"linkType":21,"id":22},"15jwOBqpxqSAOy2eOO4S0m","2024-06-04T23:50:39.089Z","2024-06-05T13:58:04.865Z",{"sys":187},{"id":29,"type":20,"linkType":30},2,{"sys":190},{"type":20,"linkType":35,"id":191},"person",{"name":193,"title":194,"company":195,"shortBio":196,"email":197},"Frío","Director","Furrific Ltd","Research and recommendations for modern stack websites.","aaron.p@furrific.uk","2017-05-16T00:00+02:00",[200,201],"javascript","static-sites",[203,219,258,292],{"metadata":204,"sys":207,"fields":217},{"tags":205,"concepts":206},[],[],{"space":208,"id":210,"type":24,"createdAt":211,"updatedAt":211,"environment":212,"publishedVersion":214,"revision":9,"contentType":215,"locale":37},{"sys":209},{"type":20,"linkType":21,"id":22},"20L0bWvehwxdGydTMy0Y6x","2025-02-14T01:38:12.137Z",{"sys":213},{"id":29,"type":20,"linkType":30},4,{"sys":216},{"type":20,"linkType":35,"id":55},{"title":218,"link":157},"What is Furrific",{"metadata":220,"sys":223,"fields":233},{"tags":221,"concepts":222},[],[],{"space":224,"id":226,"type":24,"createdAt":227,"updatedAt":228,"environment":229,"publishedVersion":31,"revision":188,"contentType":231,"locale":37},{"sys":225},{"type":20,"linkType":21,"id":22},"2kJliLs1kUtWIUiA72cTyQ","2025-02-13T17:40:27.495Z","2025-02-13T17:41:17.716Z",{"sys":230},{"id":29,"type":20,"linkType":30},{"sys":232},{"type":20,"linkType":35,"id":55},{"title":234,"link":235},"Membership",{"metadata":236,"sys":239,"fields":251},{"tags":237,"concepts":238},[],[],{"space":240,"id":242,"type":24,"createdAt":243,"updatedAt":244,"environment":245,"publishedVersion":247,"revision":248,"contentType":249,"locale":37},{"sys":241},{"type":20,"linkType":21,"id":22},"3K9b0esdy0q0yGqgW2g6Ke","2024-06-04T23:50:40.065Z","2025-02-24T00:08:25.717Z",{"sys":246},{"id":29,"type":20,"linkType":30},96,9,{"sys":250},{"type":20,"linkType":35,"id":73},{"title":234,"slug":252,"description":253,"body":254,"author":176,"publishDate":255,"tags":256},"/membership","Membership Details","::div{class=\"content-index\"}\n\n# Membership\n\nFurrific is a members only organisation operated by and for its members. It is operated primarily by an elected voluntary committee of members.\n\n## How do I join?\n\nTo become a member you must be introduced by two existing members (a nominee & seconder). Membership spaces are limited so you may be entered onto a waiting list. Your application will then be reviewed by existing members giving them opportunity to either approve or reject. If you pass the review process you will be formally invited to join the club.\n\nIf you don't know any existing members you may still apply and existing members may choose to support your application.\n\n## What next?\n\nExisting members are informed of your application to join the club, and you\nwill need to agree to basic personal details being shared with them for this to\nhappen. Typically, this will be just your furry name and links to any social\nmedia presence.\n\nMembership applications are discussed and voted on, if approved you will be admitted into the club.\n\n## Membership fees\n\nIf you attend any event during the year, the event fee covers your membership. If\nyou wish to retain membership without attending an event there is a £5 charge.\n\n## Who's in charge?\n\nEveryone! The club is fundamentally operated by its members. We hold an AGM where members elect the operating committee for the coming year. At the AGM anyone currently holding a committee position or committee-assigned role stands down and must be re-elected if they wish to continue in that role.\n\nAll members are encouraged to get involved and lend a hand however they wish to, even if they're not interested in being on the committee. Members lending a hand are referred to as Furrific Fellows.\n\n## What about the Directors?\n\nThe directors are required in order for the club to exist as a limited-by-guarantee company. Their main interest is ensuring legal compliance with UK regulation and overseeing core administrative and financial tasks. Their powers are mostly delegated to the committee which they also hold a position on and only veto decisions in matters where there would be a conflict of interest or a breach of legislation.\n\n::\n","2017-05-15T00:00+02:00",[257],"general",{"metadata":259,"sys":262,"fields":272},{"tags":260,"concepts":261},[],[],{"space":263,"id":265,"type":24,"createdAt":266,"updatedAt":267,"environment":268,"publishedVersion":31,"revision":188,"contentType":270,"locale":37},{"sys":264},{"type":20,"linkType":21,"id":22},"2uQKKZh9W5YCmJqVhwtb89","2025-02-13T17:41:06.639Z","2025-02-13T18:53:22.150Z",{"sys":269},{"id":29,"type":20,"linkType":30},{"sys":271},{"type":20,"linkType":35,"id":55},{"title":273,"link":274},"Terms and Conditions",{"metadata":275,"sys":278,"fields":289},{"tags":276,"concepts":277},[],[],{"space":279,"id":281,"type":24,"createdAt":282,"updatedAt":283,"environment":284,"publishedVersion":286,"revision":31,"contentType":287,"locale":37},{"sys":280},{"type":20,"linkType":21,"id":22},"2utBAXLZGRYfQERXhb0zWd","2025-01-22T02:27:37.666Z","2025-02-16T22:25:32.311Z",{"sys":285},{"id":29,"type":20,"linkType":30},263,{"sys":288},{"type":20,"linkType":35,"id":73},{"title":273,"slug":290,"body":291,"publishDate":138},"/legal/terms-and-conditions","::div{class=\"content-index\"}\n\n# Terms and Conditions\n\n## Definitions\n\n\"You\", \"member\", \"your\", and \"yourself\" relate to the person agreeing to these terms and conditions. “We”, \"our\", “Furrific”, \"club\" and “event” relate to the Furrific members club which is brought to you by the registered company, Furrific UK Ltd, company number 15666730, with registered address of Unit A, 82 James Carter Road, Mildenhall, United Kingdom, IP28 7DE.\n\n## What is this Document?\n\nThis document sets out the terms of conditions for membership and attendance of Furrific events. By registering for the club and it's events you agree to be bound by all of the following terms and conditions.\n\nFailure to adhere to the points below may result in your club membership being withdrawn, your removal from events.\n\nWith this in mind, please ensure that you read the following terms and conditions carefully and completely before accepting them.\n\n## Requirement of Membership\n\n* In order to be a member of Furrific you must be 18 years of age or older.\n* You must read, accept, and abide by the club's Code of Conduct & Constitution. The Code contains both general principles and more specific standards of behaviour that are expected of our members. If you breach any part of the Code of Conduct, your membership (and accommodation bookings or event bookings, if any) may be cancelled. With this in mind, please ensure you read the Code carefully and completely.\n* To receive your membership badge, which provides access to the event and activities therein, you must provide valid and in-date ID during on site registration. The ID provided must be government issued or bear the PASS holographic logo, it must also contain your photograph, your legal name, and your date of birth. These must all match the details provided to us during the online registration process. Please note that the ID should be in your legal name. If you are in the process of changing name you will need to provide government issued documentation to support this (e.g. Gender recognition certificate).\n* Failure to provide valid, in-date ID that meets the above criteria will render you unable to register for and participate in the club and its events and you may be asked to leave the venue.\n* You must make Furrific Ltd and it's first-aid team aware of any medical conditions that may require special care. Any such information provided will only be used by the first-aid team on duty to ensure that any emergency relating to your medical condition is handled appropriately.\n* Some events or activities may have additional Terms and Conditions, you must abide by these if participating in such events or activities.\n* All final decisions with regard to club policies, procedures, and their implementation lie with the Furrific committee.\n\n## Your Membership\n\n* All events and membership options are subject to availability.\n* If you are opting for a residential option at an event, it is your responsibility to arrange another member to share the room with where applicable.\n* Once we have reviewed your registration and sent a confirmation to you via your chosen email address, you will be requested to pay the full amount of the registration fee. Should you fail to pay when requested, your registration may be cancelled and any place at the event lost. If you are struggling to pay your registration on time, please contact our team at registration@furrific.uk to review your options.\n* Equally, if your room share partner does not pay their registration fee on time, your room booking may be at risk. Please contact our registration team at registration@furrific.uk immediately if this is the case.\n* If you are a participant in a room share for which the other person is the leader, their room choice will override any that you have made and neither Furrific Ltd, the event venues, or any other entity will be responsible if this does not meet with your expectations or requirements. Please communicate clearly with your chosen room partner and agree on your requirements in advance.\n* You agree to the terms and conditions of whichever payment provider you use in order to complete payment of membership & event registration fees.\n* Once your registration for the club & any events is confirmed and paid we may be unable to refund this if you subsequently wish to cancel your membership or attendance.\n* You may be given the opportunity to upload an image to represent yourself on your membership badge. By using this functionality you bestow upon us the right to reproduce the image for the sole purpose of adding it to your membership badge and that you have the right to do so. The club may, at its discretion, decline an image should it be considered offensive or could bring the club into disrepute.\n\n## Cancellations\n\n* Furrific Ltd is not responsible for circumstances beyond reasonable control, including but not limited to acts of God, war, or terrorism, extreme weather conditions, pandemic, or government action. Furrific Ltd reserves the right to cancel events with no warning in these circumstances.\n* In the event that an event is cancelled, Furrific Ltd will offer members refunds to the amount possible given expenses already incurred directly and with respect to commitments. By registering you accept both this and the possibility that, should the cancellation occur at a late enough point, such refunds may not be 100% and could in fact be zero.\n\n## Events\n\n* Event venues are private property and they have the right to refuse entry for any reason.\n* Service animals are permitted, for pets permission must be sought from the club committee and are only permitted where venues allow.\n* You must respect the wishes and follow any reasonable instructions of both venue staff, the club's event team, and any security personnel.\n* You agree to read the safety plans provided by venues in case of fire or other emergencies and to follow the rules implemented by the venue for these scenarios if they occur.\n* If you are not the holder of a residential booking including accommodation at the event venue, you are not permitted to remain in the event spaces, communal areas, or venue rooms overnight and must leave the venue each day as soon as the last event or dance concludes. Attempting to stay in the venue overnight in contravention of this rule is strictly forbidden. The venue may seek to recover costs in these cases and the club will not be liable for covering these costs.\n* If you are the holder of a residential booking including accommodation at the venue, you must not permit any non-residential member to stay in your hotel room overnight.\n* Any instance of the above that is discovered may lead to the removal of both the non-residential person from the event and any other members discovered to be facilitating this action. No refund will be given for ticket or accommodation in these cases, nor any other form of remuneration. At the discretion of committee, such instances may lead to a temporary or permanent ban from the club or future events.\n* If you participate in any club auctions and submit a bid for an item on sale, you are entering a contract of commitment to pay the bid amount on completion of the auction in the event that you are the winning bidder.\n* Any care delivered by our first-aid team is given on a “best efforts” basis. The club and its teams volunteers are not responsible for any damage to property sustained while such care is delivered.\n* While reasonable effort is taken to ensure to avoid such incidents, by attending the event you may be exposed to allergens of various forms. Furrific UK Ltd, it's event venues, nor any other associated entity are not responsible for any injury or damage resulting from such exposure.\n\n## Your Property\n\n* Furrific Ltd and it's event hosts are not responsible for any of your property that is lost, stolen or damaged; this remains your responsibility at all times and includes any vehicle left in the venue car park, which is parked at your own risk. Please take all reasonable precautions to secure your vehicle and property.\n* If you choose to use the fursuit facilities at events, neither Furrific Ltd, the event venue, or any other entity can be held responsible for any damage to or loss of property sustained.\n* If you choose to participate in any activity at the event while wearing a costume of any kind, Furrific and the venue, nor any other entity, can be held responsible for any damage that it sustains.\n\n## Website & Provided Information\n\n* Data that you enter into our membership / event registration system will be protected as described in our Privacy Policy and in accordance with the Data Protection Act. However, you are responsible for maintaining the security of your own account and should take all necessary steps to protect your account details and password. If you believe your account has been compromised in some manner you should contact us at members@furrific.uk immediately. For data protection inquiries please contact secretary@furrific.uk.\n* Should there be any technical failure within the membership system, Furrific Ltd will act within reasonable means to correct any issues with your data that occur as a result.\n* Pricing for membership & events are displayed on our website and in the membership / event registration system. We reserve the right to vary this pricing and update it on our website and systems accordingly.\n* Should there be any error in the pricing details given, Furrific Ltd is not obliged to honour such incorrect pricing and any impacted members will be contacted to advise of the correct pricing.\n* We aim to have our website remain accessible to all. However, this cannot be permanently guaranteed and access to our website is therefore permitted on a temporary, as-is, and as-available basis. Occasionally and without notice we may suspend or withdraw access to the website or any of its constituent parts for reasons including, but not limited to, maintenance or update of contents. Furrific Ltd is not responsible for any loss or inconvenience from the website or its information being unavailable.\n\n## Liability\n\n* You agree not to hold Furrific Limited or its team members liable for injury or loss/damage to person or property while arriving, attending, or departing events. The full liability waiver is listed below and acceptance of it, while voluntary, is a condition of sale.\n* You agree to take reasonable precautions to prevent injury to yourself and your property during an event. As a condition of attending an event, you hereby, for yourself, your heirs, executors, and administrators, voluntarily and freely agree to assume all responsibilities for any and all risks of damage or injury that may occur to you or your property resulting from or arising out of, or incident to, your attendance of the event.\n* You hereby voluntarily and freely release and discharge Furrific Ltd and all of its volunteers, employees, agents, successors, and assignees from any and all claims, damages, and rights of action that you, your heirs, executors, and administrators now have or may hereafter have for any injury to you, or your property resulting from or arising out of, or incident to, your attendance of club events, including, but not limited to, any claims of damages or injury that might result from the negligence, actions, or omissions of the organisers of the club events and/or employees of Furrific Limited.\n* If there are any changes to this agreement or the associate policies, we will update these on our website and notify affected members by email.",{"metadata":293,"sys":296,"fields":305},{"tags":294,"concepts":295},[],[],{"space":297,"id":299,"type":24,"createdAt":300,"updatedAt":300,"environment":301,"publishedVersion":32,"revision":9,"contentType":303,"locale":37},{"sys":298},{"type":20,"linkType":21,"id":22},"3Tx9o6T0pdnkydL807k2oY","2025-02-23T23:44:31.142Z",{"sys":302},{"id":29,"type":20,"linkType":30},{"sys":304},{"type":20,"linkType":35,"id":55},{"title":306,"link":307},"Privacy Policy",{"metadata":308,"sys":311,"fields":322},{"tags":309,"concepts":310},[],[],{"space":312,"id":314,"type":24,"createdAt":315,"updatedAt":316,"environment":317,"publishedVersion":319,"revision":52,"contentType":320,"locale":37},{"sys":313},{"type":20,"linkType":21,"id":22},"7jUVBhN6r2p2hhW9hwdBoc","2025-02-23T23:31:19.527Z","2025-02-23T23:38:00.749Z",{"sys":318},{"id":29,"type":20,"linkType":30},62,{"sys":321},{"type":20,"linkType":35,"id":73},{"title":306,"slug":323,"description":306,"body":324,"publishDate":325},"/privacy-policy","::div{class=\"content-index\"}\n\n# Furrific Privacy Policy\nV1.0 – Published 23/02/2025\n\n## What is this document?\nThis document is the privacy policy for Furrific Ltd, outlining the approach Furrific Ltd takes to data protection and how it complies with relevant UK legislation.\n\n## Who are we and what do we do?\nFurrific Ltd is the legal entity which runs the Furrific members club and associated events. Furrific is primarily a not for profit members club which runs occasional events for its members. Other variations of the name may be used in trading.\n\nThis policy explains when and why we collect personal information about our members and others who may visit our website, how we use that information, the conditions under which we may disclose it to others, and how we keep it secure.\n\nThis policy is updated from time to time so please check this page occasionally to ensure that you are aware and happy with any changes. By using our website or becoming a member of Furrific you agree to be bound by this policy.\n\nAny questions regarding this policy and our privacy practices should be sent by email to [privacy-25@furrfic.uk](mailto:privacy-25@furrfic.uk). You have the right to make a complaint at any time to the Information Commissioner’s Office (ICO) regarding data protection issues, which can be reached via their website at [ico.org.uk](https://ico.org.uk/). However, we would appreciate the chance to deal with your concerns before you approach the ICO and would ask that you please contact us in the first instance.\n\n## How and what information do we collect from you?\nWe do not collect specific information about you when you visit our website. Your browser may save preferences depending on your settings or pre-fill information; please check your browser settings for more information. If you choose to become a member of Furrific, register for one of our events, contact us about our operations, products, or services, or register to receive one of our newsletters or contact forms, we will retain personally identifiable information limited to that required for delivery of those services or requests.\n\nThe personal information we collect may include your name, registered address, email address, IP address, and information regarding what pages are accessed and when. If you make a payment online, your card information will not be held by us and instead it is collected by our third party payment processors who specialise in the secure processing of credit/debit card transactions. This is a technical requirement of their services.\n\nWe may collect, use, and share aggregated data such as statistical or demographic data for any purpose. Aggregated data could be derived from your personal data but is not considered personal data in law as this data will not directly or indirectly reveal your identity. However, if we combine or connect aggregated data with your personal data so that it can directly or indirectly identify you, we treat the combined data as personal data which will be used in accordance with this policy.\n\nWe do not collect the following Special Categories of Personal Data about you; details about your race or ethnicity, religious or philosophical beliefs, sex life, sexual orientation, political opinions, trade union membership or biometric data. Nor do we collect any information about criminal convictions and offences. We will collect medical information on a voluntary basis to allow the provision of first aid to be administered promptly and effectively. This information may be passed on to a doctor, medical professional or other emergency services as required for the protection and preservation of life.\n\n## How will we use your information?\n\nWe may use your information to:\n\n- Process or administer your membership or application thereof\n- Carry out any contractual obligations\n- Detect and reduce fraud and credit risk\n- Process any application to help out with our events or club operations\n- Notify of changes to our event operations, service delivery options, changes to membership or any other changes affecting you\n- Make you aware of any information regarding Furrific for which you would reasonably expect notice\n- Seek your views or comments on the events and services we provide\n- Send communications which you have requested\n- Identify and return lost property\n- Produce statistical summaries for open publication\n- To improve our services\n\nWe review our retention periods for personal information on a regular basis and are legally required to hold some types of information to fulfil our statutory obligations. We will hold your personal information on our systems for as long as is necessary for the relevant activity concerned, as long as legally required, or as long as is set out in any relevant contract you hold with us.\n\n## Who has access to your information?\nYour personal information will not be sold to third parties nor will it be shared for marketing purposes. We may transfer your personal information to a third party if we are under a duty to disclose or share your personal data in order to comply with any legal obligation, to enforce or apply our terms of use, or to protect the rights, property, or safety of our staff and customers. When you are using our secure online registration pages your payment may be processed by a third party payment processor who specialises in the secure online capture and processing of credit/debit card transactions.\n\nWe may pass your information to our third party service providers, agents, subcontractors, and other associated organisations for the purposes of completing tasks and providing services to you on our behalf. However, when we use third party service providers, we disclose only the personal information that is necessary to technically deliver the service and we will ensure that they will be required to keep your information secure and not to use it for their own direct marketing purposes.\n\nWe will not release your information to third parties unless, as stated above, you have requested us to do so, or we are required to do so by law, for example by a court order or for the purposes of prevention of fraud or other crime.\nIf you have any questions regarding secure transactions, please contact us via email at [privacy-25@furrfic.uk](mailto:privacy-25@furrfic.uk).\n\n## Your choices and updating information\nIt is your choice whether or not you wish to receive information from us; generally all contact from us will be related to the direct delivery of membership services, including any events that Furrific may operate. We will not contact you for marketing purposes unless you have given your prior consent for this. If you wish to change your preferences after selecting them at any time, please email us at [privacy-25@furrfic.uk](mailto:privacy-25@furrfic.uk).\n\nGenerally, to update the details that we hold for you, you will need to log in to our [registration system](https://reg.furrific.uk/) and amend your details accordingly. Should the system be closed please contact the club secretary and we will seek to update this in your place.\n\nShould you require a copy of the information held about you we may charge a reasonable administrative fee if the request is manifestly unfounded, excessive, or repeated following previous requests.\n\n## Security precautions used\n\nWe use a wide range of appropriate technical and organisational measures to safeguard access to, and use of, your personal information and to ensure it retains its integrity and availability. These include structured access controls to systems, network protection, intrusion detection, physical access controls, and staff training. We also consider anonymising or pseudonymising personal data where practical. Sensitive information (such as credit or debit card details) will not be held by us and payment service providers will be expected to use encryption and protection to the highest standards.\n\nOnce we receive your information we make our best effort to ensure its security on our systems and only retain data as long as required for the purposes of processing or legal requirements. Password access will be used internally which should be kept secret and not disclosed to others, if you have a password to allow access to certain areas of our website we would advise you keep this safe and secure.\n\n## Website cookies\nMost websites use cookies which are small text files that are placed on your device for various purposes including improving site functionality and facilitating various services. We suggest consulting the help section of your browser or taking a look at the [About Cookies website](https://www.aboutcookies.org/) which offers guidance for all modern browsers. You can choose to disable or delete cookies at any time; this may affect your ability to use our website to its fullest extent.\n\n## Links to other websites\nThis privacy policy applies only to our website and services and does not extend to any website you may visit via any link that we provide. On that basis, we would recommend you read the privacy policy of any other website you visit when linked from our site. We cannot be responsible for the privacy policies and practices of other sites even if you access them using links from our website.\n\n## Transferring your information outside of the UK\nAs part of the services offered to you through our website the information which you provide to us may be transferred to countries outside the United Kingdom (UK) or European Union (EU). Furrific  will ensure that any service providers utilised to store or process your personal data outside of the UK/EU have themselves undertaken GDPR-compliant data protection policies of their own.\n\n## Where should questions on this policy be directed?\nPlease direct any questions on this policy to our inbox at [privacy-25@furrfic.uk](mailto:privacy-25@furrfic.uk).\n","2025-02-23T00:00+00:00",{"Entry":327,"Asset":328},[176,203,157,219,258,274,235,292,41,104,139,119,307,58],[76],[330,332,334],{"title":57,"order":-1,"slug":75,"children":331},[],{"title":118,"order":-1,"slug":136,"children":333},[],{"title":156,"order":-1,"slug":174,"children":335},[336,338,340,342],{"title":218,"order":-1,"slug":174,"children":337},[],{"title":234,"order":-1,"slug":252,"children":339},[],{"title":273,"order":-1,"slug":290,"children":341},[],{"title":306,"order":-1,"slug":323,"children":343},[],{"data":345,"body":347,"excerpt":-1,"toc":1005},{"title":346,"description":346},"",{"type":348,"children":349},"root",[350],{"type":351,"tag":352,"props":353,"children":356},"element","div",{"className":354},[355],"content-index",[357,365,371,378,383,389,394,400,446,452,459,489,495,560,567,597,603,628,634,664,670,695,701,711,717,732,738,758,764,799,805,820,826,846,852,858,868,874,884,890,900,906,916,922,967,973,983,989,994,1000],{"type":351,"tag":358,"props":359,"children":361},"h1",{"id":360},"constitution-of-furrific-ltd",[362],{"type":363,"value":364},"text","Constitution of Furrific Ltd",{"type":351,"tag":366,"props":367,"children":368},"p",{},[369],{"type":363,"value":370},"We, the members of Furrific, establish this constitution to govern our operations and uphold our shared values within the furry community. This constitution embodies inclusivity, transparency, and collective governance, fostering a vibrant and welcoming furry community. This constitution is in addition to the articles of association using the devolved powers granted to it by the directors.",{"type":351,"tag":372,"props":373,"children":375},"h2",{"id":374},"_1-name",[376],{"type":363,"value":377},"1. Name",{"type":351,"tag":366,"props":379,"children":380},{},[381],{"type":363,"value":382},"1.1. The name of the company is “Furrific Ltd”, hereafter referred to as “the organisation.”",{"type":351,"tag":372,"props":384,"children":386},{"id":385},"_2-purpose",[387],{"type":363,"value":388},"2. Purpose",{"type":351,"tag":366,"props":390,"children":391},{},[392],{"type":363,"value":393},"2.1. The purpose of the organisation shall be to provide a platform for its members to engage in social, recreational, and educational activities pertaining to the furry fandom whilst fostering a sense of community and camaraderie among its members.",{"type":351,"tag":372,"props":395,"children":397},{"id":396},"_3-membership",[398],{"type":363,"value":399},"3. Membership",{"type":351,"tag":366,"props":401,"children":402},{},[403,405,409,411,414,416,419,421,424,426,429,431,434,436,439,441,444],{"type":363,"value":404},"3.1. Membership in the organisation shall be open to individuals who meet the membership criteria as determined by the organisation’s governing body.",{"type":351,"tag":406,"props":407,"children":408},"br",{},[],{"type":363,"value":410},"\n3.2. Annual membership fee, set by the committee.",{"type":351,"tag":406,"props":412,"children":413},{},[],{"type":363,"value":415},"\n3.3. Prospective members shall submit a membership application which will require nomination and seconding by existing members, in addition to any required dues or fees as determined by the organisation.",{"type":351,"tag":406,"props":417,"children":418},{},[],{"type":363,"value":420},"\n3.4. New members will be subject to vetting by the membership body.",{"type":351,"tag":406,"props":422,"children":423},{},[],{"type":363,"value":425},"\n3.5. The directors may revoke or suspend membership for violations of the organisation’s rules, conduct deemed detrimental to the organisation’s reputation or behaviour threatening to the welfare of other members.",{"type":351,"tag":406,"props":427,"children":428},{},[],{"type":363,"value":430},"\n3.6. Members must be over 18 years old.",{"type":351,"tag":406,"props":432,"children":433},{},[],{"type":363,"value":435},"\n3.7. Members should be considered to be of good moral standing.",{"type":351,"tag":406,"props":437,"children":438},{},[],{"type":363,"value":440},"\n3.8. The committee may limit the number of memberships as deemed necessary.",{"type":351,"tag":406,"props":442,"children":443},{},[],{"type":363,"value":445},"\n3.9. A new member will be required to wait for an opening if this limit is exceeded.",{"type":351,"tag":372,"props":447,"children":449},{"id":448},"_4-governance",[450],{"type":363,"value":451},"4. Governance",{"type":351,"tag":453,"props":454,"children":456},"h3",{"id":455},"_41-board-of-directors",[457],{"type":363,"value":458},"4.1. Board of Directors",{"type":351,"tag":366,"props":460,"children":461},{},[462,464,467,469,472,474,477,479,482,484,487],{"type":363,"value":463},"4.1.1. Responsible for legal matters and holds veto power over decisions with legal implications.",{"type":351,"tag":406,"props":465,"children":466},{},[],{"type":363,"value":468},"\n4.1.2. Directors must have a clean legal record and automatically hold a position on the committee.",{"type":351,"tag":406,"props":470,"children":471},{},[],{"type":363,"value":473},"\n4.1.3. A minimum of three directors are required to prevent stalemate, vacancies are filled promptly through AGM or EGM.",{"type":351,"tag":406,"props":475,"children":476},{},[],{"type":363,"value":478},"\n4.1.4. Complimentary membership renewals are granted after three years of service.",{"type":351,"tag":406,"props":480,"children":481},{},[],{"type":363,"value":483},"\n4.1.5. Are governed by the articles of association & legal obligations.",{"type":351,"tag":406,"props":485,"children":486},{},[],{"type":363,"value":488},"\n4.1.6. Hold de facto positions on committees.",{"type":351,"tag":453,"props":490,"children":492},{"id":491},"_42-committee",[493],{"type":363,"value":494},"4.2. Committee",{"type":351,"tag":366,"props":496,"children":497},{},[498,500,503,505,508,510,513,515,518,520,523,525,528,530,533,535,538,540,543,545,548,550,553,555,558],{"type":363,"value":499},"4.2.1. Composed of directors board plus at least 2 additional members.",{"type":351,"tag":406,"props":501,"children":502},{},[],{"type":363,"value":504},"\n4.2.2. Responsible for overall management and operation of the organisation including setting policies, approving budgets and organising events.",{"type":351,"tag":406,"props":506,"children":507},{},[],{"type":363,"value":509},"\n4.2.3. Additional members elected at the AGM.",{"type":351,"tag":406,"props":511,"children":512},{},[],{"type":363,"value":514},"\n4.2.4. The size of the committee is decided by directors at the AGM.",{"type":351,"tag":406,"props":516,"children":517},{},[],{"type":363,"value":519},"\n4.2.5. Committee may vote to co-opt up to 3 additional members or up to 1% of membership whichever is greater.",{"type":351,"tag":406,"props":521,"children":522},{},[],{"type":363,"value":524},"\n4.2.6. Provides strategic guidance and ensures compliance with governing documents.",{"type":351,"tag":406,"props":526,"children":527},{},[],{"type":363,"value":529},"\n4.2.7. Committee members shall serve a term of 1 year from date of appointment, with an allowance up to a maximum of 2 years if circumstances require. Committee members may only serve additional years following re-election by members or co-opted by the current committee.",{"type":351,"tag":406,"props":531,"children":532},{},[],{"type":363,"value":534},"\n4.2.8. Committee members may be removed for misconduct or neglect of duties by a two-thirds majority vote of the membership.",{"type":351,"tag":406,"props":536,"children":537},{},[],{"type":363,"value":539},"\n4.2.9. Responsible for formation of officers and providing support to them.",{"type":351,"tag":406,"props":541,"children":542},{},[],{"type":363,"value":544},"\n4.2.10. Should document processes & contacts.",{"type":351,"tag":406,"props":546,"children":547},{},[],{"type":363,"value":549},"\n4.2.11. A quorum is achieved when more than half of committee members inc. directors are present.",{"type":351,"tag":406,"props":551,"children":552},{},[],{"type":363,"value":554},"\n4.2.12. Resolutions by committee are conducted by instant run-off (alternative vote) with at least two-thirds (66%) majority required to pass.",{"type":351,"tag":406,"props":556,"children":557},{},[],{"type":363,"value":559},"\n4.2.13. 3 members of the committee are required to act as chair, secretary & treasurer. These positions are collectively referred to as the committee coordinators.",{"type":351,"tag":561,"props":562,"children":564},"h4",{"id":563},"_4214-committee-chair",[565],{"type":363,"value":566},"4.2.14. Committee Chair",{"type":351,"tag":366,"props":568,"children":569},{},[570,572,575,577,580,582,585,587,590,592,595],{"type":363,"value":571},"4.2.14.1. A primary representative of the organisation, overseeing all its objectives.",{"type":351,"tag":406,"props":573,"children":574},{},[],{"type":363,"value":576},"\n4.2.14.2. Chairs all committee meetings ensuring they run smoothly and in an orderly manner.",{"type":351,"tag":406,"props":578,"children":579},{},[],{"type":363,"value":581},"\n4.2.14.3. Leads on key decision-making, ensuring all perspectives within the organisation are considered.",{"type":351,"tag":406,"props":583,"children":584},{},[],{"type":363,"value":586},"\n4.2.14.4. Acts as a mediator for disputes or conflicts, aiming to maintain a welcoming atmosphere for all members.",{"type":351,"tag":406,"props":588,"children":589},{},[],{"type":363,"value":591},"\n4.2.14.5. Develops and drives the long-term vision for the organisation, considering future events, collaborations and community involvement.",{"type":351,"tag":406,"props":593,"children":594},{},[],{"type":363,"value":596},"\n4.2.14.6. Ensures that the committee members fulfil their duties and supports them in their roles as needed.",{"type":351,"tag":561,"props":598,"children":600},{"id":599},"_4215-secretary",[601],{"type":363,"value":602},"4.2.15. Secretary",{"type":351,"tag":366,"props":604,"children":605},{},[606,608,611,613,616,618,621,623,626],{"type":363,"value":607},"4.2.15.1. Organises and documents meetings, including preparing agendas, sending invites, taking minutes and distributing them.",{"type":351,"tag":406,"props":609,"children":610},{},[],{"type":363,"value":612},"\n4.2.15.2. Overseas membership applications, renewals and maintains an accurate database of members, ensuring records are up to date.",{"type":351,"tag":406,"props":614,"children":615},{},[],{"type":363,"value":617},"\n4.2.15.3. Primary point of communication for members, handling inquiries and distributing announcements and updates.",{"type":351,"tag":406,"props":619,"children":620},{},[],{"type":363,"value":622},"\n4.2.15.4. Keeps accurate records of activities, decisions and communications, ensuring they are accessible to the committee.",{"type":351,"tag":406,"props":624,"children":625},{},[],{"type":363,"value":627},"\n4.2.15.5. Assists in the planning and organisation of events, helping coordinate logistics and promotions.",{"type":351,"tag":561,"props":629,"children":631},{"id":630},"_4216-treasurer",[632],{"type":363,"value":633},"4.2.16. Treasurer",{"type":351,"tag":366,"props":635,"children":636},{},[637,639,642,644,647,649,652,654,657,659,662],{"type":363,"value":638},"4.2.16.1. Oversees the organisation's finances, including budgeting, monitoring expenses and ensuring financial stability.",{"type":351,"tag":406,"props":640,"children":641},{},[],{"type":363,"value":643},"\n4.2.16.2. Keep detailed financial records, including income from both member and non-member activities, manage receipts, invoices and payment records.",{"type":351,"tag":406,"props":645,"children":646},{},[],{"type":363,"value":648},"\n4.2.16.3. Prepare financial reports for the committee and members, including annual statements, forecasts and balance sheets.",{"type":351,"tag":406,"props":650,"children":651},{},[],{"type":363,"value":653},"\n4.2.16.4. Manage the collection of membership payments, ensuring payments are on time and follow up on any late payments.",{"type":351,"tag":406,"props":655,"children":656},{},[],{"type":363,"value":658},"\n4.2.16.5. Identifies opportunities for fundraising, sponsorships, and grants to support the organisation's objectives, and manages funds raised through events or other initiatives.",{"type":351,"tag":406,"props":660,"children":661},{},[],{"type":363,"value":663},"\n4.2.16.6. Ensures compliance with financial regulations, including proper handling of taxable and non-taxable income, in line with mutual trading rules.",{"type":351,"tag":453,"props":665,"children":667},{"id":666},"_43-team-leads",[668],{"type":363,"value":669},"4.3. Team Leads",{"type":351,"tag":366,"props":671,"children":672},{},[673,675,678,680,683,685,688,690,693],{"type":363,"value":674},"4.3.1. Appointed by the committee from membership, capable non-committee members are preferred.",{"type":351,"tag":406,"props":676,"children":677},{},[],{"type":363,"value":679},"\n4.3.2. Perform tasks delegated by the committee.",{"type":351,"tag":406,"props":681,"children":682},{},[],{"type":363,"value":684},"\n4.3.3. Leads may recruit crew/volunteers from membership into their teams where applicable.",{"type":351,"tag":406,"props":686,"children":687},{},[],{"type":363,"value":689},"\n4.3.4. Leads serve for a term of 1 year, up to a maximum of 2 years if circumstances require. May be reappointed for additional terms by the committee.",{"type":351,"tag":406,"props":691,"children":692},{},[],{"type":363,"value":694},"\n4.3.5. Leads may be removed from positions for misconduct or neglect of duties by a two-thirds majority vote of the committee.",{"type":351,"tag":453,"props":696,"children":698},{"id":697},"_44-fellows",[699],{"type":363,"value":700},"4.4. Fellows",{"type":351,"tag":366,"props":702,"children":703},{},[704,706,709],{"type":363,"value":705},"4.4.1. Recruited by leads to assist in their tasks & projects.",{"type":351,"tag":406,"props":707,"children":708},{},[],{"type":363,"value":710},"\n4.4.2. Managed directly by leads and report back to them.",{"type":351,"tag":372,"props":712,"children":714},{"id":713},"_5-meetings",[715],{"type":363,"value":716},"5. Meetings",{"type":351,"tag":366,"props":718,"children":719},{},[720,722,725,727,730],{"type":363,"value":721},"5.1. The committee shall hold regular meetings at least 3 times per year.",{"type":351,"tag":406,"props":723,"children":724},{},[],{"type":363,"value":726},"\n5.2. Notice of the meetings shall be provided to all applicable members at least 14 days in advance.",{"type":351,"tag":406,"props":728,"children":729},{},[],{"type":363,"value":731},"\n5.3. All meetings shall be conducted according to procedures ensuring order is maintained and all members have an opportunity to participate.",{"type":351,"tag":453,"props":733,"children":735},{"id":734},"_54-voting",[736],{"type":363,"value":737},"5.4. Voting",{"type":351,"tag":366,"props":739,"children":740},{},[741,743,746,748,751,753,756],{"type":363,"value":742},"5.4.1. Proxy voting is permitted before meetings, members are notified seven days in advance.",{"type":351,"tag":406,"props":744,"children":745},{},[],{"type":363,"value":747},"\n5.4.2. Candidate proposals are distributed no less than seven days before elections.",{"type":351,"tag":406,"props":749,"children":750},{},[],{"type":363,"value":752},"\n5.4.3. Any member with more than 1 year of membership is entitled to participate in organisation-wide votes.",{"type":351,"tag":406,"props":754,"children":755},{},[],{"type":363,"value":757},"\n5.4.4. Alternative vote a.k.a. Instant run-off to be used where there are greater than 2 options available. Rounds continue until a greater than 50% majority is achieved.",{"type":351,"tag":453,"props":759,"children":761},{"id":760},"_55-agm",[762],{"type":363,"value":763},"5.5. AGM",{"type":351,"tag":366,"props":765,"children":766},{},[767,769,772,774,777,779,782,784,787,789,792,794,797],{"type":363,"value":768},"5.5.1. AGMs are held once per year, ideally within 14 months of the previous meeting where possible. But no more than 24 months.",{"type":351,"tag":406,"props":770,"children":771},{},[],{"type":363,"value":773},"\n5.5.2. Directors, chair, secretary & treasurer to submit reports, and additional reports provided by leads where applicable.",{"type":351,"tag":406,"props":775,"children":776},{},[],{"type":363,"value":778},"\n5.5.3. The existing committee is dissolved, leads & fellows are relieved of duties.",{"type":351,"tag":406,"props":780,"children":781},{},[],{"type":363,"value":783},"\n5.5.4. New committee members are elected by members as follows:",{"type":351,"tag":406,"props":785,"children":786},{},[],{"type":363,"value":788},"\n5.5.4.1. Candidates read their proposals.",{"type":351,"tag":406,"props":790,"children":791},{},[],{"type":363,"value":793},"\n5.5.4.2. Members vote for candidates through instant runoff a.k.a. Alternative vote.",{"type":351,"tag":406,"props":795,"children":796},{},[],{"type":363,"value":798},"\n5.5.5. Committee appoints leads at the first meeting proceeding the AGM.",{"type":351,"tag":453,"props":800,"children":802},{"id":801},"_56-egm",[803],{"type":363,"value":804},"5.6. EGM",{"type":351,"tag":366,"props":806,"children":807},{},[808,810,813,815,818],{"type":363,"value":809},"5.6.1. Called by directors or committee secretary upon request.",{"type":351,"tag":406,"props":811,"children":812},{},[],{"type":363,"value":814},"\n5.6.2. May be called to resolve matters that can’t wait until the next AGM.",{"type":351,"tag":406,"props":816,"children":817},{},[],{"type":363,"value":819},"\n5.6.3. The committee is not dissolved, leads & fellows retain status unless resolved resolutions require.",{"type":351,"tag":372,"props":821,"children":823},{"id":822},"_6-events",[824],{"type":363,"value":825},"6. Events",{"type":351,"tag":366,"props":827,"children":828},{},[829,831,834,836,839,841,844],{"type":363,"value":830},"6.1. Organised by committee with support from leads & fellows.",{"type":351,"tag":406,"props":832,"children":833},{},[],{"type":363,"value":835},"\n6.2. The committee is responsible for appointing appropriate leads to ensure smooth running of the event.",{"type":351,"tag":406,"props":837,"children":838},{},[],{"type":363,"value":840},"\n6.3. To be for the benefit of the majority of members.",{"type":351,"tag":406,"props":842,"children":843},{},[],{"type":363,"value":845},"\n6.4. Should be self-funding.",{"type":351,"tag":453,"props":847,"children":849},{"id":848},"_65-on-duty-officer-role",[850],{"type":363,"value":851},"6.5. On-duty Officer Role",{"type":351,"tag":561,"props":853,"children":855},{"id":854},"_651-definition-and-appointment",[856],{"type":363,"value":857},"6.5.1. Definition and Appointment",{"type":351,"tag":366,"props":859,"children":860},{},[861,863,866],{"type":363,"value":862},"6.5.1.1. The On-Duty Officer is a temporary position assigned during the organisation's events to ensure smooth and consistent oversight of event operations.",{"type":351,"tag":406,"props":864,"children":865},{},[],{"type":363,"value":867},"\n6.5.1.2. The committee shall appoint an On-Duty Officer for each event or delegate the role in rotation among qualified individuals as designated by the committee.",{"type":351,"tag":561,"props":869,"children":871},{"id":870},"_652-authority-and-responsibilities",[872],{"type":363,"value":873},"6.5.2. Authority and Responsibilities",{"type":351,"tag":366,"props":875,"children":876},{},[877,879,882],{"type":363,"value":878},"6.5.2.1. The On-Duty Officer shall have the authority to make immediate operational decisions during the organisation’s events in response to urgent matters, safety issues, and general event flow to ensure a secure and enjoyable experience for all members.",{"type":351,"tag":406,"props":880,"children":881},{},[],{"type":363,"value":883},"\n6.5.2.2. This role includes overseeing activities, coordinating between the organisation’s event team and members, and addressing unforeseen issues or emergencies.",{"type":351,"tag":561,"props":885,"children":887},{"id":886},"_653-limitations-of-authority",[888],{"type":363,"value":889},"6.5.3. Limitations of Authority",{"type":351,"tag":366,"props":891,"children":892},{},[893,895,898],{"type":363,"value":894},"6.5.3.1. While empowered to make necessary decisions for event continuity, the On-Duty Officer must act in the best interest of the current event, the organisation, plus its members and in accordance with the organisation’s policies and guidelines.",{"type":351,"tag":406,"props":896,"children":897},{},[],{"type":363,"value":899},"\n6.5.3.2. Major decisions affecting the organisation’s policies, finances, or constitutional matters require consultation with the committee or the directors if practical within the time frame.",{"type":351,"tag":561,"props":901,"children":903},{"id":902},"_654-accountability",[904],{"type":363,"value":905},"6.5.4. Accountability",{"type":351,"tag":366,"props":907,"children":908},{},[909,911,914],{"type":363,"value":910},"6.5.4.1. The On-Duty Officer must document all significant actions taken and decisions made in a report, to be presented to the committee and directors after the event for review.",{"type":351,"tag":406,"props":912,"children":913},{},[],{"type":363,"value":915},"\n6.5.4.2. Any actions that exceed the scope of their authority or contravene the organisation’s policies may be subject to committee review and potential corrective actions.",{"type":351,"tag":372,"props":917,"children":919},{"id":918},"_7-finances",[920],{"type":363,"value":921},"7. Finances",{"type":351,"tag":366,"props":923,"children":924},{},[925,927,930,932,935,937,940,942,945,947,950,952,955,957,960,962,965],{"type":363,"value":926},"7.1. The organisation shall maintain accurate financial records and operate within a budget approved by the committee.",{"type":351,"tag":406,"props":928,"children":929},{},[],{"type":363,"value":931},"\n7.2. Dues and fees shall be determined by the committee.",{"type":351,"tag":406,"props":933,"children":934},{},[],{"type":363,"value":936},"\n7.3. The treasurer shall be responsible for collecting dues, paying expenses and providing financial reports to the membership.",{"type":351,"tag":406,"props":938,"children":939},{},[],{"type":363,"value":941},"\n7.4. Members may claim for expenses no later than 6 months after the date of receipt. Committee approval is otherwise required.",{"type":351,"tag":406,"props":943,"children":944},{},[],{"type":363,"value":946},"\n7.5. Treasurer to provide guidance on expenses which require additional approval.",{"type":351,"tag":406,"props":948,"children":949},{},[],{"type":363,"value":951},"\n7.6. All bank accounts should where possible require 2 or more signatories to approve any outgoing payment.",{"type":351,"tag":406,"props":953,"children":954},{},[],{"type":363,"value":956},"\n7.7. All directors have access to bank accounts in addition where possible to the treasurer & secretary.",{"type":351,"tag":406,"props":958,"children":959},{},[],{"type":363,"value":961},"\n7.8. Accounts should be maintained using a double or triple-entry system.",{"type":351,"tag":406,"props":963,"children":964},{},[],{"type":363,"value":966},"\n7.9. Treasurer may select the organisation used for managing the accounts providing it complies with the above.",{"type":351,"tag":372,"props":968,"children":970},{"id":969},"_8-amendments",[971],{"type":363,"value":972},"8. Amendments",{"type":351,"tag":366,"props":974,"children":975},{},[976,978,981],{"type":363,"value":977},"8.1. This constitution may be amended by a two-thirds (66%) majority vote by the membership at an AGM or EGM.",{"type":351,"tag":406,"props":979,"children":980},{},[],{"type":363,"value":982},"\n8.2. Proposed amendments must be submitted in writing to the secretary and distributed to all members at least 7 days in advance of the meeting.",{"type":351,"tag":372,"props":984,"children":986},{"id":985},"_9-dissolution",[987],{"type":363,"value":988},"9. Dissolution",{"type":351,"tag":366,"props":990,"children":991},{},[992],{"type":363,"value":993},"9.1. In the event of the dissolution of the organisation, any remaining assets after liabilities shall be returned to the membership.",{"type":351,"tag":372,"props":995,"children":997},{"id":996},"_10-ratification",[998],{"type":363,"value":999},"10. Ratification",{"type":351,"tag":366,"props":1001,"children":1002},{},[1003],{"type":363,"value":1004},"10.1. This constitution shall take effect upon approval by a two-thirds majority vote of the membership.",{"title":346,"searchDepth":188,"depth":188,"links":1006},[1007,1008,1009,1010,1016,1021,1024,1025,1026,1027],{"id":374,"depth":188,"text":377},{"id":385,"depth":188,"text":388},{"id":396,"depth":188,"text":399},{"id":448,"depth":188,"text":451,"children":1011},[1012,1013,1014,1015],{"id":455,"depth":32,"text":458},{"id":491,"depth":32,"text":494},{"id":666,"depth":32,"text":669},{"id":697,"depth":32,"text":700},{"id":713,"depth":188,"text":716,"children":1017},[1018,1019,1020],{"id":734,"depth":32,"text":737},{"id":760,"depth":32,"text":763},{"id":801,"depth":32,"text":804},{"id":822,"depth":188,"text":825,"children":1022},[1023],{"id":848,"depth":32,"text":851},{"id":918,"depth":188,"text":921},{"id":969,"depth":188,"text":972},{"id":985,"depth":188,"text":988},{"id":996,"depth":188,"text":999},1740365444187]